{
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which is the higher-grossing 2020 movie, 1917 or Bad Boys for Life?\nEntities: [{'ID': 'Q2092', 'Label': '1917', 'Description': 'year', 'Probability': 0.1024}, {'ID': 'Q62721520', 'Label': '1917', 'Description': '2019 film by Sam Mendes', 'Probability': 0.1012}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P2142_16WHERE { wd:Q62721520 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_16 ; n1:P3005 wd:Q13780930 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which countries in North America do not have English as an official language?\nEntities: [{'ID': 'Q49', 'Label': 'North America', 'Description': \"continent on the Earth's northwestern quadrant, spanning from the Arctic Archipelago to the Panama Isthmus\", 'Probability': 0.9897}, {'ID': 'Q1860', 'Label': 'English', 'Description': 'West Germanic language', 'Probability': 0.4597}, {'ID': 'Q21', 'Label': 'England', 'Description': 'country in north-west Europe, part of the United Kingdom', 'Probability': 0.2542}, {'ID': 'Q42406', 'Label': 'English people', 'Description': 'ethnic group native to England', 'Probability': 0.1801}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q6256_1 WHERE { ?Q6256_1 wdt:P31 wd:Q6256 . ?Q6256_1 p:<P30:continent> [ ps:<P30:continent> wd:Q49 ] . FILTER ( NOT EXISTS { ?Q6256_1 p:<P37:official_language> [ ps:<P37:official_language> wd:Q1860 ] . } ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Twilight movie made the most money?\nEntities: [{'ID': 'Q160071', 'Label': 'Twilight', 'Description': '2008 film directed by Catherine Hardwicke', 'Probability': 0.2113}, {'ID': 'Q164160', 'Label': 'twilight', 'Description': \"illumination of the Earth's lower atmosphere when the Sun itself is not directly visible because it is below the horizon\", 'Probability': 0.1569}, {'ID': 'Q44523', 'Label': 'Twilight', 'Description': 'series of vampire romance novels by Stephenie Meyer', 'Probability': 0.1133}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2142_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q652599 ] . ?Q11424_349 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_353 ] . } ORDER BY DESC(?P2142_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 26th president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"26\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Percy Jackson series of books have not been made into movies?\nEntities: [{'ID': 'Q3899725', 'Label': 'Percy Jackson', 'Description': 'fictional boy and demigod, protagonist of series Percy Jackson & the Olympians, The Heroes of Olympus and The Trials of Apollo', 'Probability': 0.7755}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P1441_8 ?P527_46 WHERE { wd:Q3899725 p:<P1441:present_in_work> [ ps:<P1441:present_in_work> ?P1441_8 ] . ?P1441_8 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_46 ] . FILTER ( NOT EXISTS { ?P179_84 wdt:P31 wd:Q24856 . ?P527_46 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> ?P179_84 ] . } ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How did Charles Bukowski die?\nEntities: [{'ID': 'Q76409', 'Label': 'Charles Bukowski', 'Description': 'German-American writer (1920\u20131994)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P509_8WHERE { wd:Q76409 p:<P509:cause_of_death> [ ps:<P509:cause_of_death> ?P509_8 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the second Harry Potter movie chronologically?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"2\" ; ps:<P179:part_of_the_series> wd:Q216930 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Marvel movies can Thanos be seen in?\nEntities: [{'ID': 'Q173496', 'Label': 'Marvel Comics', 'Description': 'company that publishes comic books and related media', 'Probability': 0.6464}, {'ID': 'Q1200552', 'Label': 'Marvel Entertainment', 'Description': 'American entertainment company', 'Probability': 0.1076}, {'ID': 'Q2276627', 'Label': 'Thanos', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.815}, {'ID': 'Q96408036', 'Label': None, 'Description': None, 'Probability': 0.135}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_84) AS ?number_of_121) WHERE { ?Q11424_84 wdt:P31 wd:Q11424 . ?Q11424_84 p:<P674:characters> [ ps:<P674:characters> wd:Q64825451 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 24th president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"24\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the name of the ninth Fast & Furious movie?\nEntities: [{'ID': 'Q1576873', 'Label': 'Fast & Furious', 'Description': 'American action film franchise', 'Probability': 0.5337}, {'ID': 'Q380996', 'Label': 'Fast & Furious', 'Description': '2009 film directed by Justin Lin', 'Probability': 0.3988}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"9\" ; ps:<P179:part_of_the_series> wd:Q1576873 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which original member of Earth, Wind and Fire is not alive?\nEntities: [{'ID': 'Q28974', 'Label': 'Earth, Wind & Fire', 'Description': 'American band', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P527_8 ?P570_46 WHERE { wd:Q28974 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_8 ] . ?P527_8 p:<P570:date_of_death> [ ps:<P570:date_of_death> ?P570_46 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Is Henry Cavill taller than Ben Affleck?\nEntities: [{'ID': 'Q295498', 'Label': 'Henry Cavill', 'Description': 'British actor', 'Probability': 1.0}, {'ID': 'Q483118', 'Label': 'Ben Affleck', 'Description': 'American film actor, director and screenwriter', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P2048_16WHERE { wd:Q483118 p:<P2048:height> [ ps:<P2048:height> ?P2048_16 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Lethal Weapon movies are there?\nEntities: [{'ID': 'Q462447', 'Label': 'Lethal Weapon', 'Description': '1987 film directed by Richard Donner', 'Probability': 0.5177}, {'ID': 'Q24070370', 'Label': 'Lethal Weapon', 'Description': 'TV series', 'Probability': 0.2518}, {'ID': 'Q1777059', 'Label': 'Lethal Weapon', 'Description': 'American series of buddy cop action films', 'Probability': 0.117}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_8) AS ?number_of_45) WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q1777059 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Academy Awards did Black Panther win?\nEntities: [{'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.9099}, {'ID': 'Q998220', 'Label': 'Black Panther', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.3649}, {'ID': 'Q23780734', 'Label': 'Black Panther', 'Description': '2018 film directed by Ryan Coogler', 'Probability': 0.2799}, {'ID': 'Q189150', 'Label': 'Black Panther Party', 'Description': 'Black revolutionary socialist organization', 'Probability': 0.1506}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?thing_8 WHERE { wd:Q23780734 p:<P166:award_received> [ ps:<P166:award_received> ?thing_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 12th vice president of the United States?\nEntities: [{'ID': 'Q11699', 'Label': 'Vice President of the United States', 'Description': 'second-highest constitutional office in the United States', 'Probability': 0.999}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ ps:<P39:position_held> wd:Q11699 ; n1<P1545:series_ordinal> \"12\" ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What game does the character Soldier 76 come from?\nEntities: [{'ID': 'Q60790153', 'Label': 'Soldier: 76', 'Description': 'fictional character from Overwatch video game', 'Probability': 0.865}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7889_1 WHERE { ?Q7889_1 wdt:P31 wd:Q7889 . ?Q7889_1 p:<P674:characters> [ ps:<P674:characters> wd:Q60790153 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which 2012 Quentin Tarantino movie does not star Uma Thurman?\nEntities: [{'ID': 'Q3772', 'Label': 'Quentin Tarantino', 'Description': 'American film director, screenwriter, producer, and actor', 'Probability': 0.9994}, {'ID': 'Q125017', 'Label': 'Uma Thurman', 'Description': 'American actress', 'Probability': 0.9558}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P57:director> [ ps:<P57:director> wd:Q3772 ] . FILTER ( NOT EXISTS { ?Q11424_8 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q125017 ] . } ) ?Q11424_8 p:<P57:director>7 [ ps:<P57:director>7 ?date ] . FILTER (year(?date) = 2012) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Hobbit movie is the longest?\nEntities: [{'ID': 'Q74359', 'Label': 'Hobbit', 'Description': \"fictional race from J. R. R. Tolkien's legendarium\", 'Probability': 0.8212}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2047_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q74331 ] . ?Q11424_349 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_353 ] . } ORDER BY DESC(?P2047_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the last movie in the Dirty Harry franchise?\nEntities: [{'ID': 'Q110206', 'Label': 'Dirty Harry', 'Description': '1971 film directed by Don Siegel', 'Probability': 0.7246}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"5\" ; ps:<P179:part_of_the_series> wd:Q2712648 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Lord of the Rings movie is the shortest?\nEntities: [{'ID': 'Q15228', 'Label': 'The Lord of the Rings', 'Description': '1954\u20131955 fantasy novel by J. R. R. Tolkien', 'Probability': 0.5616}, {'ID': 'Q190214', 'Label': 'The Lord of the Rings trilogy', 'Description': '2001-2003 three films directed by Peter Jackson', 'Probability': 0.2414}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2047_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q190214 ] . ?Q11424_349 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_353 ] . } ORDER BY ASC(?P2047_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the tallest mountain in Europe?\nEntities: [{'ID': 'Q46', 'Label': 'Europe', 'Description': 'continent', 'Probability': 0.967}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q8502_1 ?P2044_38 WHERE { ?Q8502_1 wdt:P31 wd:Q8502 . ?Q8502_1 p:<P30:continent> [ ps:<P30:continent> wd:Q46 ] . ?Q8502_1 p:<P2044:elevation_above_sea_level> [ ps:<P2044:elevation_above_sea_level> ?P2044_38 ] . } ORDER BY DESC(?P2044_38) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which My Chemical Romance album came out in 2002?\nEntities: [{'ID': 'Q483285', 'Label': 'My Chemical Romance', 'Description': 'American rock band', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q482994_8 WHERE { ?Q482994_8 wdt:P31 wd:Q482994 . ?Q482994_8 p:<P175:performer> [ ps:<P175:performer> wd:Q483285 ] . ?Q482994_8 p:<P577:publication_date> [ ps:<P577:publication_date> \"2002-07-23T00:00:00Z\"^^xsd:dateTime ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movies did Brad Pitt produce and act in at the same time?\nEntities: [{'ID': 'Q35332', 'Label': 'Brad Pitt', 'Description': 'American actor and filmmaker', 'Probability': 0.9927}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P162:producer> [ ps:<P162:producer> wd:Q35332 ] . ?Q11424_8 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q35332 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: In what game can you play as a character named Teemo\"?\"\nEntities: [{'ID': 'Q223341', 'Label': 'League of Legends', 'Description': '2009 multiplayer online battle arena video game', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7889_1 WHERE { ?Q7889_1 wdt:P31 wd:Q7889 . ?Q7889_1 p:<P674:characters> [ ps:<P674:characters> wd:Q100255087 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 12th president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"12\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Richard Sherman join the Tampa Bay Buccaneers before 2020?\nEntities: [{'ID': 'Q2947411', 'Label': 'Richard Sherman', 'Description': 'American football player (born 1988)', 'Probability': 0.8106}, {'ID': 'Q2318968', 'Label': 'Richard M. Sherman', 'Description': 'American songwriter', 'Probability': 0.1288}, {'ID': 'Q320476', 'Label': 'Tampa Bay Buccaneers', 'Description': 'National Football League franchise in Tampa, Florida', 'Probability': 0.8274}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P580_4 ?expr_90 WHERE { wd:Q2947411 p:<P54:member_of_sports_team> [ n1<P580:start_time> ?P580_4 ; ps:<P54:member_of_sports_team> wd:Q320476 ] . BIND (year(?P580_4) AS ?expr_90) FILTER ( xsd:double(str(?expr_90)) <= 2020 ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Judy Blume books were not meant for those under eighteen?\nEntities: [{'ID': 'Q441214', 'Label': 'Judy Blume', 'Description': \"American children's writer\", 'Probability': 0.9841}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?thing_8 WHERE { ?thing_8 p:<P50:author> [ ps:<P50:author> wd:Q441214 ] . FILTER ( NOT EXISTS { ?thing_8 p:<P2360:intended_public> [ ps:<P2360:intended_public> wd:Q7569 ] . } ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many capital cities have populations over 10 million?\nEntities: [{'ID': 'Q5119', 'Label': 'capital city', 'Description': 'primary governing city of a top-level (country) or first-level and second-level subdivision (country, state, province, regency, etc) political entity', 'Probability': 0.9}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5119_1 ?P1082_112 WHERE { ?Q5119_1 wdt:P31 wd:Q5119 . ?Q5119_1 p:<P1082:population> [ ps:<P1082:population> ?P1082_112 ] . FILTER ( xsd:double(str(?P1082_112)) >= 10000000 ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When was Obama first elected?\nEntities: [{'ID': 'Q76', 'Label': 'Barack Obama', 'Description': 'president of the United States from 2009 to 2017', 'Probability': 0.8629}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P580_4 WHERE { wd:Q76 p:<P39:position_held> [ n2<P580:start_time> ?P580_4 ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Lord of the Rings movie cost the least money to make?\nEntities: [{'ID': 'Q15228', 'Label': 'The Lord of the Rings', 'Description': '1954\u20131955 fantasy novel by J. R. R. Tolkien', 'Probability': 0.5616}, {'ID': 'Q190214', 'Label': 'The Lord of the Rings trilogy', 'Description': '2001-2003 three films directed by Peter Jackson', 'Probability': 0.2414}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2130_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q190214 ] . ?Q11424_349 p:<P2130:cost> [ ps:<P2130:cost> ?P2130_353 ] . } ORDER BY ASC(?P2130_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie had a higher lifetime gross, Titanic or Avatar?\nEntities: [{'ID': 'Q44578', 'Label': 'Titanic', 'Description': '1997 film by James Cameron', 'Probability': 0.4532}, {'ID': 'Q25173', 'Label': 'Titanic', 'Description': 'British transatlantic passenger liner, launched and foundered in 1912', 'Probability': 0.3498}, {'ID': 'Q83090', 'Label': 'avatar', 'Description': 'material appearance or incarnation of a deity on earth in Hinduism', 'Probability': 0.3927}, {'ID': 'Q24871', 'Label': 'Avatar', 'Description': '2009 film by James Cameron', 'Probability': 0.3202}, {'ID': 'Q152402', 'Label': 'avatar', 'Description': \"graphical representation of the user or the user's alter ego or character\", 'Probability': 0.1582}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P2142_16WHERE { wd:Q24871 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_16 ; n1:P3005 wd:Q13780930 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 14th president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"14\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When did Clint Eastwood receive his first Oscar?\nEntities: [{'ID': 'Q43203', 'Label': 'Clint Eastwood', 'Description': 'American actor and film director (born 1930)', 'Probability': 0.9697}, {'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.6452}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?thing_1 ?P585_17 WHERE { ?thing_1 p:<P166:award_received> [ ps:<P166:award_received> wd:Q103360 ; n1<P585:point_in_time> ?P585_17 ] . FILTER ( ?thing_1 = wd:Q43203 ) } ORDER BY ASC(?P585) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which book in the Game of Thrones series was released in 2005?\nEntities: [{'ID': 'Q23572', 'Label': 'Game of Thrones', 'Description': 'American fantasy drama television series', 'Probability': 0.9644}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_8 ?P577_45 WHERE { ?Q7725634_8 wdt:P31 wd:Q7725634 . wd:Q45875 p:<P4969:derivative_work> [ ps:<P4969:derivative_work> wd:Q23572 ] . ?Q7725634_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q45875 ] . ?Q7725634_8 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_45 ] . FILTER ( (year(?P577_45) = \"2005\"^^xsd:integer) ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie actress was born in Dalby, Australia and has also played a leading role in the Suicide Squad movie?\nEntities: [{'ID': 'Q1001056', 'Label': 'Dalby', 'Description': 'town in Queensland, Australia', 'Probability': 0.6667}, {'ID': 'Q408', 'Label': 'Australia', 'Description': 'country in Oceania', 'Probability': 0.8709}, {'ID': 'Q616136', 'Label': 'Suicide Squad', 'Description': 'DC Comics antihero team', 'Probability': 0.5101}, {'ID': 'Q18604504', 'Label': 'Suicide Squad', 'Description': '2016 film directed by David Ayer', 'Probability': 0.3812}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_247 WHERE { ?Q5_247 wdt:P31 wd:Q5 . ?Q5_247 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> wd:Q1001056 ] . wd:Q18604504 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_247 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which The Godfather movie was not released in the 1970s?\nEntities: [{'ID': 'Q223973', 'Label': 'godparent', 'Description': \"person who sponsors a child's baptism\", 'Probability': 0.7046}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P577_45 ?expr_131 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q3225260 ] . ?Q11424_8 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_45 ] . BIND (year(?P577_45) AS ?expr_131) FILTER ( !( (  xsd:double(str(?expr_131)) >= 1970 && xsd:double(str(?expr_131)) <= 1979 ) ) ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the name of the second Fast & Furious movie?\nEntities: [{'ID': 'Q1576873', 'Label': 'Fast & Furious', 'Description': 'American action film franchise', 'Probability': 0.5337}, {'ID': 'Q380996', 'Label': 'Fast & Furious', 'Description': '2009 film directed by Justin Lin', 'Probability': 0.3988}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"2\" ; ps:<P179:part_of_the_series> wd:Q1576873 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was Christopher Walken's first movie?\nEntities: [{'ID': 'Q185051', 'Label': 'Christopher Walken', 'Description': 'American actor', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P577_12 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q185051 ] . ?Q11424_8 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_12 ] . } ORDER BY ASC(?P577_12) LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Hunger Games movie made the most money?\nEntities: [{'ID': 'Q11679', 'Label': 'The Hunger Games', 'Description': 'three books by Suzanne Collins (2008\u20132010)', 'Probability': 0.6716}, {'ID': 'Q212965', 'Label': 'The Hunger Games', 'Description': '2012 film by Gary Ross', 'Probability': 0.2239}, {'ID': 'Q11885031', 'Label': 'The Hunger Games', 'Description': 'dystopian film series', 'Probability': 0.1045}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2142_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q11885031 ] . ?Q11424_349 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_353 ] . } ORDER BY DESC(?P2142_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who won Best Director for the Academy Awards in 1938?\nEntities: [{'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.9099}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_9WHERE { ?Q5_9 wdt:P31 wd:Q5 .?Q5_9 p:<P106:occupation> [ ps:<P106:occupation> wd:Q2526255 ] .?Q5_9 p:<P166:award_received> [ n1<P585:point_in_time> \"1938-01-01T00:00:00Z\"^^xsd:dateTime ; ps:<P166:award_received> wd:Q103360 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Harper Lee novel was not published in the 20th century?\nEntities: [{'ID': 'Q182658', 'Label': 'Harper Lee', 'Description': 'American author', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?thing_8 ?P577_46 ?expr_173 WHERE { ?thing_8 p:<P50:author> [ ps:<P50:author> wd:Q182658 ] . ?thing_8 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_46 ] . BIND (year(?P577_46) AS ?expr_173) FILTER ( xsd:double(str(?expr_173)) >= 2000 ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which of the current U2 members were born outside of Ireland?\nEntities: [{'ID': 'Q396', 'Label': 'U2', 'Description': 'Irish rock band', 'Probability': 0.9617}, {'ID': 'Q22890', 'Label': 'Ireland', 'Description': 'island in the North Atlantic Ocean', 'Probability': 0.5546}, {'ID': 'Q27', 'Label': 'Republic of Ireland', 'Description': 'country in Northwestern Europe', 'Probability': 0.2651}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P463_8 WHERE { ?P463_8 p:<P463:member_of> [ ps:<P463:member_of> wd:Q396 ] . FILTER ( NOT EXISTS { ?P463_8 p:<P27:country_of_citizenship> [ ps:<P27:country_of_citizenship> wd:Q27 ] . } ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Where is Dorothy Gale from?\nEntities: [{'ID': 'Q2583524', 'Label': 'Dorothy Gale', 'Description': 'fictional protagonist of many of the Oz novels by the American author L. Frank Baum', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P551_8WHERE { wd:Q2583524 p:<P551:residence> [ ps:<P551:residence> ?P551_8 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many mainline Pok\u00e9mon games have come out on Switch?\nEntities: [{'ID': 'Q864', 'Label': 'Pok\u00e9mon', 'Description': 'Japanese media franchise', 'Probability': 0.6986}, {'ID': 'Q239937', 'Label': 'Pok\u00e9mon', 'Description': 'Japanese anime television series', 'Probability': 0.1783}, {'ID': 'Q5320', 'Label': 'electrical switch', 'Description': 'electrical component that can break an electrical circuit', 'Probability': 0.2652}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q7889_1) AS ?number_of_38) WHERE { ?Q7889_1 wdt:P31 wd:Q7889 . ?Q7889_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q24558579 ] . ?Q7889_1 p:<P400:platform> [ ps:<P400:platform> wd:Q19610114 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many movies has Tom Cruise been in and been nominated for an Academy Award?\nEntities: [{'ID': 'Q37079', 'Label': 'Tom Cruise', 'Description': 'American actor and producer (born 1962)', 'Probability': 0.9951}, {'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.9167}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_8) AS ?number_of_88) WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q37079 ] . ?Q19020_47 wdt:P31 wd:Q19020 . ?Q11424_8 p:<P1411:nominated_for> [ ps:<P1411:nominated_for> ?Q19020_47 ] . ?Q19020_47 wdt:P31 wd:Q96474691 . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which country has a higher population, Greenland or Iceland?\nEntities: [{'ID': 'Q223', 'Label': 'Greenland', 'Description': \"autonomous country within the Kingdom of Denmark on world's largest island by the same name\", 'Probability': 0.9596}, {'ID': 'Q189', 'Label': 'Iceland', 'Description': 'Nordic island country in the North Atlantic Ocean', 'Probability': 0.8621}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P1082_24WHERE { wd:Q223 p:<P1082:population> [ ps:<P1082:population> ?P1082_24 ; n1<P585:point_in_time> \"2019-01-01T00:00:00Z\"^^xsd:dateTime ] . }LIMIT 200\n"
        }