{
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the first book Orson Scott Card wrote?\nEntities: [{'ID': 'Q217110', 'Label': 'Orson Scott Card', 'Description': 'American science fiction novelist', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 ?P577_5 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P50:author> [ ps:<P50:author> wd:Q217110 ] . ?Q7725634_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_5 ] . } ORDER BY ASC(?P577_5) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the highest-grossing movie of all time in America?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.5665}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2142_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_353 ; n1:P3005 wd:Q30 ] . } ORDER BY DESC(?P2142_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the shortest river in the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q4022_1 ?P2043_38 WHERE { ?Q4022_1 wdt:P31 wd:Q4022 . ?Q4022_1 p:<P17:country> [ ps:<P17:country> wd:Q30 ] . ?Q4022_1 p:<P2043:length> [ ps:<P2043:length> ?P2043_38 ] . } ORDER BY ASC(?P2043_38) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many times has Francis Ford Coppola won Best Director?\nEntities: [{'ID': 'Q56094', 'Label': 'Francis Ford Coppola', 'Description': 'American filmmaker', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?P1686_6) AS ?number_of_109) WHERE { wd:Q56094 p:<P166:award_received> [ n1<P1686:for_work> ?P1686_6 ; ps:<P166:award_received> wd:Q103360 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Twilight movie has the longest runtime?\nEntities: [{'ID': 'Q160071', 'Label': 'Twilight', 'Description': '2008 film directed by Catherine Hardwicke', 'Probability': 0.2113}, {'ID': 'Q164160', 'Label': 'twilight', 'Description': \"illumination of the Earth's lower atmosphere when the Sun itself is not directly visible because it is below the horizon\", 'Probability': 0.1569}, {'ID': 'Q44523', 'Label': 'Twilight', 'Description': 'series of vampire romance novels by Stephenie Meyer', 'Probability': 0.1133}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2047_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q652599 ] . ?Q11424_349 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_353 ] . } ORDER BY DESC(?P2047_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the name of the last Harry Potter movie?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P577_5 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q216930 ] . ?Q11424_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_5 ] . } ORDER BY DESC(?P577_5) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Jaws movies are there?\nEntities: [{'ID': 'Q189505', 'Label': 'Jaws', 'Description': '1975 film directed by Steven Spielberg', 'Probability': 0.6878}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_84) AS ?number_of_121) WHERE { ?Q11424_84 wdt:P31 wd:Q11424 . ?Q11424_84 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q6166233 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie had Jeff Bridges in it and was produced by Ethan Cohen?\nEntities: [{'ID': 'Q174843', 'Label': 'Jeff Bridges', 'Description': 'American actor', 'Probability': 0.9836}, {'ID': 'Q20684068', 'Label': 'Ethan Cohen', 'Description': 'American collector and art dealer based in New York City', 'Probability': 0.75}, {'ID': 'Q56095', 'Label': 'Coen brothers', 'Description': 'American filmmakers', 'Probability': 0.25}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P162:producer> [ ps:<P162:producer> wd:Q13595531 ] . ?Q11424_8 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q174843 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 25th president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"25\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the first Harry Potter movie chronologically?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P577_5 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q216930 ] . ?Q11424_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_5 ] . } ORDER BY ASC(?P577_5) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Hobbit movies are there directed by Peter Jackson?\nEntities: [{'ID': 'Q74359', 'Label': 'Hobbit', 'Description': \"fictional race from J. R. R. Tolkien's legendarium\", 'Probability': 0.8212}, {'ID': 'Q4465', 'Label': 'Peter Jackson', 'Description': 'New Zealand film director, screenwriter and producer', 'Probability': 0.7733}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_8) AS ?number_of_45) WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q74331 ] . ?Q11424_8 p:<P57:director> [ ps:<P57:director> wd:Q4465 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Ace Ventura movies are there?\nEntities: [{'ID': 'Q2712598', 'Label': 'Ace Ventura', 'Description': 'movie character', 'Probability': 0.725}, {'ID': 'Q2822935', 'Label': 'Ace Ventura', 'Description': 'film series', 'Probability': 0.15}, {'ID': 'Q2822938', 'Label': 'Ace Ventura: The CD-Rom Game', 'Description': '1996 video game', 'Probability': 0.125}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_1) AS ?number_of_38) WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . VALUES ?Q11424_1 { wd:Q340127 wd:Q340138 wd:Q2712598 wd:Q340071 wd:Q82986 wd:Q2822935 wd:Q2822938 wd:Q63171358 wd:Q340044 wd:Q17084420 wd:Q6667860 wd:Q20121219 wd:Q8220063 wd:Q605860 wd:Q58794608 wd:Q82589786 wd:Q9745113 wd:Q46029706 wd:Q44569117 wd:Q77595938 wd:Q83154369 wd:Q64877953 wd:Q113496343 wd:Q89987817 wd:Q84773748 wd:Q64124348 wd:Q112700795} }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actors in Black Panther are no longer alive?\nEntities: [{'ID': 'Q998220', 'Label': 'Black Panther', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.3649}, {'ID': 'Q23780734', 'Label': 'Black Panther', 'Description': '2018 film directed by Ryan Coogler', 'Probability': 0.2799}, {'ID': 'Q189150', 'Label': 'Black Panther Party', 'Description': 'Black revolutionary socialist organization', 'Probability': 0.1506}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P161_8 ?P509_111 WHERE { wd:Q23780734 p:<P161:cast_member> [ ps:<P161:cast_member> ?P161_8 ] . ?P161_8 p:<P509:cause_of_death> [ ps:<P509:cause_of_death> ?P509_111 ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did the original Ocean's Eleven come out after 1965?\nEntities: [{'ID': 'Q205447', 'Label': \"Ocean's Eleven\", 'Description': '2001 film by Steven Soderbergh', 'Probability': 0.8735}, {'ID': 'Q464933', 'Label': \"Ocean's 11\", 'Description': '1960 heist film directed by Lewis Milestone', 'Probability': 0.1024}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_94 WHERE { wd:Q205447 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_94) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Avatar came out before 2010?\nEntities: [{'ID': 'Q83090', 'Label': 'avatar', 'Description': 'material appearance or incarnation of a deity on earth in Hinduism', 'Probability': 0.3927}, {'ID': 'Q24871', 'Label': 'Avatar', 'Description': '2009 film by James Cameron', 'Probability': 0.3202}, {'ID': 'Q152402', 'Label': 'avatar', 'Description': \"graphical representation of the user or the user's alter ego or character\", 'Probability': 0.1582}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_94 WHERE { wd:Q24871 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_94) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many books about death are in the Discworld series?\nEntities: [{'ID': 'Q3257270', 'Label': 'Discworld', 'Description': 'novel series by Terry Pratchett', 'Probability': 0.7602}, {'ID': 'Q253295', 'Label': 'Discworld', 'Description': 'fictional universe by Terry Pratchett', 'Probability': 0.1754}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q7725634_8) AS ?number_of_45) WHERE { ?Q7725634_8 wdt:P31 wd:Q7725634 . ?Q7725634_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q54877325 ] . ?Q7725634_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q3257270 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which of the Jurassic Park movies is the longest?\nEntities: [{'ID': 'Q167726', 'Label': 'Jurassic Park', 'Description': '1993 film directed by Steven Spielberg', 'Probability': 0.5498}, {'ID': 'Q2336369', 'Label': 'Jurassic Park', 'Description': 'American science fiction media franchise', 'Probability': 0.2525}, {'ID': 'Q756866', 'Label': 'Jurassic Park', 'Description': '1990 science fiction novel by Michael Crichton', 'Probability': 0.102}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2047_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q17862144 ] . ?Q11424_349 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_353 ] . } ORDER BY DESC(?P2047_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who plays Katniss Everdeen in the Hunger Games movie series?\nEntities: [{'ID': 'Q2071301', 'Label': 'Katniss Everdeen', 'Description': 'character in the Hunger Games story', 'Probability': 1.0}, {'ID': 'Q11679', 'Label': 'The Hunger Games', 'Description': 'three books by Suzanne Collins (2008\u20132010)', 'Probability': 0.6716}, {'ID': 'Q212965', 'Label': 'The Hunger Games', 'Description': '2012 film by Gary Ross', 'Probability': 0.2239}, {'ID': 'Q11885031', 'Label': 'The Hunger Games', 'Description': 'dystopian film series', 'Probability': 0.1045}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_8 ?Q11424_45 WHERE { ?Q5_8 wdt:P31 wd:Q5 . ?Q11424_45 wdt:P31 wd:Q11424 . ?Q11424_45 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_8 ; n1<P453:character_role> wd:Q2071301 ] . ?Q11424_45 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q11885031 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the first woman to become vice president?\nEntities: [{'ID': 'Q11699', 'Label': 'Vice President of the United States', 'Description': 'second-highest constitutional office in the United States', 'Probability': 0.7148}, {'ID': 'Q42178', 'Label': 'vice president', 'Description': 'officer in government or business', 'Probability': 0.1361}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ ps:<P39:position_held> wd:Q11699 ] . ?Q5_1 p:<P21:sex_or_gender> [ ps:<P21:sex_or_gender> wd:Q6581072 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the first movie Quentin Tarantino directed?\nEntities: [{'ID': 'Q3772', 'Label': 'Quentin Tarantino', 'Description': 'American film director, screenwriter, producer, and actor', 'Probability': 0.9994}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P577_5 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q3772 ] . ?Q11424_1 p:<P57:director>7 [ ps:<P57:director>7 ?P577_5 ] . } ORDER BY ASC(?P577_5) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When did the first Game of Thrones book come out?\nEntities: [{'ID': 'Q23572', 'Label': 'Game of Thrones', 'Description': 'American fantasy drama television series', 'Probability': 0.9644}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 ?P577_5 ?expr_132 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q45875 ] . ?Q7725634_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_5 ] . BIND (year(?P577_5) AS ?expr_132) FILTER ( IsLiteral(?P577_5) ) } ORDER BY ASC(?P577_5) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the third movie in the Peter Jackson Lord of the Rings trilogy?\nEntities: [{'ID': 'Q4465', 'Label': 'Peter Jackson', 'Description': 'New Zealand film director, screenwriter and producer', 'Probability': 0.7733}, {'ID': 'Q15228', 'Label': 'The Lord of the Rings', 'Description': '1954\u20131955 fantasy novel by J. R. R. Tolkien', 'Probability': 0.5616}, {'ID': 'Q190214', 'Label': 'The Lord of the Rings trilogy', 'Description': '2001-2003 three films directed by Peter Jackson', 'Probability': 0.2414}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"3\" ; ps:<P179:part_of_the_series> wd:Q190214 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the name of the first enemy you see in Super Mario Brothers for original Nintendo (NES)?\nEntities: [{'ID': 'Q11168', 'Label': 'Super Mario Bros.', 'Description': '1985 platform video game', 'Probability': 0.6786}, {'ID': 'Q535550', 'Label': 'Super Mario Bros.', 'Description': '1993 film directed by Rocky Morton and Annabel Jankel', 'Probability': 0.2143}, {'ID': 'Q8093', 'Label': 'Nintendo', 'Description': 'Japanese multinational video game and consumer electronics company', 'Probability': 0.9918}, {'ID': 'Q172742', 'Label': 'Nintendo Entertainment System', 'Description': 'home video game console', 'Probability': 0.7414}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P674_8 ?P4584_46WHERE { wd:Q11168 p:<P400:platform> [ ps:<P400:platform> wd:Q172742 ] .wd:Q11168 p:<P674:characters> [ ps:<P674:characters> ?P674_8 ] .?P674_8 p:P4584 [ ps:P4584 ?P4584_46 ] .?P674_8 p:P7047 [ ps:P7047 wd:Q12379 ] . }LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by Taylor Hackford and starred Damian Chapa?\nEntities: [{'ID': 'Q545573', 'Label': 'Taylor Hackford', 'Description': 'American film director, and president of the Directors Guild of America', 'Probability': 1.0}, {'ID': 'Q927017', 'Label': 'Damian Chapa', 'Description': 'actor, film director', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q545573 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q927017 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which member of Amon Amarth was not born in Sweden?\nEntities: [{'ID': 'Q192863', 'Label': 'Amon Amarth', 'Description': 'Swedish melodic death metal band', 'Probability': 0.9885}, {'ID': 'Q34', 'Label': 'Sweden', 'Description': 'country in Northern Europe', 'Probability': 0.865}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P463_8 WHERE { ?P463_8 p:<P463:member_of> [ ps:<P463:member_of> wd:Q192863 ] . FILTER ( NOT EXISTS { ?P463_8 p:<P27:country_of_citizenship> [ ps:<P27:country_of_citizenship> wd:Q34 ] . } ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Harry Potter film is the shortest?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P2047_12 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q216930 ] . ?Q11424_8 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_12 ] . } ORDER BY ASC(?P2047_12) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the highest-grossing movie in the world?\nEntities: [{'ID': 'Q11424', 'Label': 'film', 'Description': 'sequence of images that give the impression of movement, stored on film stock', 'Probability': 0.32}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P2142_45 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_45 ] . } ORDER BY DESC(?P2142_45) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie is part of the Marvel Cinematic Universe and has Chadwick Boseman in the titular role?\nEntities: [{'ID': 'Q642878', 'Label': 'Marvel Cinematic Universe', 'Description': 'shared fictional universe', 'Probability': 1.0}, {'ID': 'Q5066520', 'Label': 'Chadwick Boseman', 'Description': 'American actor (1976-2020)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q5066520 ] . wd:Q642878 p:<P1445:fictional_universe_described_in> [ ps:<P1445:fictional_universe_described_in> ?Q11424_1 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who is the longest serving Indian president in terms of number of years?\nEntities: [{'ID': 'Q328799', 'Label': 'cinema of India', 'Description': 'filmmaking industry in India', 'Probability': 0.3062}, {'ID': 'Q862086', 'Label': 'Indians', 'Description': 'citizens or residents of India', 'Probability': 0.2079}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q5_1 ?P580_9 ?P582_135 ?expr_222 ?expr_308 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ ps:<P39:position_held> wd:Q313383 ; n1<P580:start_time> ?P580_9 ; n1<P582:end_time> ?P582_135 ] . BIND (year(?P580_9) AS ?expr_222) BIND (abs((?expr_222 - year(?P582_135))) AS ?expr_308) } ORDER BY DESC(?expr_308) LIMIT 1 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the name of the third Fast & Furious movie?\nEntities: [{'ID': 'Q1576873', 'Label': 'Fast & Furious', 'Description': 'American action film franchise', 'Probability': 0.5337}, {'ID': 'Q380996', 'Label': 'Fast & Furious', 'Description': '2009 film directed by Justin Lin', 'Probability': 0.3988}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_9 WHERE { ?Q11424_9 wdt:P31 wd:Q11424 . ?Q11424_9 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"3\" ; ps:<P179:part_of_the_series> wd:Q1576873 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When did Usain Bolt win his first Olympic medal?\nEntities: [{'ID': 'Q1189', 'Label': 'Usain Bolt', 'Description': 'Jamaican sprinter', 'Probability': 1.0}, {'ID': 'Q5389', 'Label': 'Olympic Games', 'Description': 'major international sport event', 'Probability': 0.6531}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q18536594_9 ?P585_254 ?expr_381 WHERE { ?Q18536594_9 wdt:P31 wd:Q18536594 . ?Q18536594_9 p:<P1346:winner> [ ps:<P1346:winner> wd:Q1189 ] . ?Q18536594_9 p:<P585:point_in_time> [ ps:<P585:point_in_time> ?P585_254 ] . BIND (year(?P585_254) AS ?expr_381) } ORDER BY ASC(?P585_254) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many US presidents were from North Carolina?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.9022}, {'ID': 'Q1454', 'Label': 'North Carolina', 'Description': 'state of the United States of America', 'Probability': 0.8767}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q5_1) AS ?number_of_56) WHERE { ?Q5_1 wdt:P31 wd:Q5 . wd:Q30 p:<P6:head_of_government> [ ps:<P6:head_of_government> ?Q5_1 ] . ?Q5_1 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> ?P19_10 ] . ?P19_10 p:<P131:located_in_the_administrative_territorial_entity> [ ps:<P131:located_in_the_administrative_territorial_entity> ?P131_19 ] . ?P131_19 p:<P131:located_in_the_administrative_territorial_entity> [ ps:<P131:located_in_the_administrative_territorial_entity> wd:Q1454 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Steven Spielberg movie made the most money?\nEntities: [{'ID': 'Q8877', 'Label': 'Steven Spielberg', 'Description': 'American filmmaker (born 1946)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P2142_7 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_7 ] . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q8877 ] . } ORDER BY DESC(?P2142_7) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the first prime minister of Japan?\nEntities: [{'ID': 'Q17', 'Label': 'Japan', 'Description': 'island country in East Asia', 'Probability': 0.8987}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?P580_5 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P580:start_time> ?P580_5 ; ps:<P39:position_held> wd:Q274948 ] . } ORDER BY ASC(?P580_5) LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Oscars did Titanic win?\nEntities: [{'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.9239}, {'ID': 'Q44578', 'Label': 'Titanic', 'Description': '1997 film by James Cameron', 'Probability': 0.4532}, {'ID': 'Q25173', 'Label': 'Titanic', 'Description': 'British transatlantic passenger liner, launched and foundered in 1912', 'Probability': 0.3498}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?P527_39) AS ?number_of_219) WHERE { wd:Q44578 p:<P166:award_received> [ ps:<P166:award_received> ?P527_39 ] . wd:Q19020 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_39 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the third book in the Wheel of Time series?\nEntities: [{'ID': 'Q4470', 'Label': 'The Wheel of Time', 'Description': 'series of fantasy novels by Robert Jordan', 'Probability': 0.4921}, {'ID': 'Q7992037', 'Label': 'Wheel of time', 'Description': 'religious and philosophical concept of cyclical, repeating epochs or ages', 'Probability': 0.2063}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ n2<P1545:series_ordinal> \"3\" ; ps:<P179:part_of_the_series> wd:Q4470 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the first African American to become a senator?\nEntities: [{'ID': 'Q2035701', 'Label': 'Race and ethnicity in the United States Census', 'Description': 'data items in which residents choose races they most closely identify with', 'Probability': 0.8038}, {'ID': 'Q49085', 'Label': 'African Americans', 'Description': 'Americans with sub-Saharan African ancestry', 'Probability': 0.194}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?P580_9 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ ps:<P39:position_held> wd:Q4416090 ; n1<P580:start_time> ?P580_9 ] . ?Q5_1 p:<P172:ethnic_group> [ ps:<P172:ethnic_group> wd:Q49085 ] . } ORDER BY ASC(?P580_9) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which member of One Direction was not born in England?\nEntities: [{'ID': 'Q146027', 'Label': 'One Direction', 'Description': 'English-Irish boy band', 'Probability': 1.0}, {'ID': 'Q21', 'Label': 'England', 'Description': 'country in north-west Europe, part of the United Kingdom', 'Probability': 0.7456}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P527_4 ?P19_42 WHERE { wd:Q146027 p:<P31:instance_of> [ ps:<P31:instance_of> wd:Q216337 ] . wd:Q146027 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_4 ] . ?P527_4 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> ?P19_42 ] . FILTER ( NOT EXISTS { ?P19_42 p:<P17:country> [ ps:<P17:country> wd:Q145 ] . } ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did True Romance come out before 1995?\nEntities: [{'ID': 'Q1127709', 'Label': 'True Romance', 'Description': '1993 film by Tony Scott', 'Probability': 0.7616}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P577_8 ?expr_134 WHERE { wd:Q1127709 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_134) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the fourth Star Wars movie titled?\nEntities: [{'ID': 'Q462', 'Label': 'Star Wars', 'Description': 'epic space opera multimedia franchise created by George Lucas', 'Probability': 0.7404}, {'ID': 'Q17738', 'Label': 'Star Wars: Episode IV \u2013 A New Hope', 'Description': '1977 American epic space opera film directed by George Lucas', 'Probability': 0.1947}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q22092344 ; n1<P1545:series_ordinal> \"4\" ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who wrote Journey to the Center of the Earth?\nEntities: []\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P50_8WHERE { wd:Q219457 p:<P50:author> [ ps:<P50:author> ?P50_8 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many children did Lily Potter have?\nEntities: [{'ID': 'Q178453', 'Label': 'Order of the Phoenix', 'Description': 'fictional secret organisation from Harry Potter', 'Probability': 0.8889}, {'ID': 'Q754837', 'Label': 'Lily Potter', 'Description': 'fictional character of the Harry Potter series', 'Probability': 0.1111}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?P40_8) AS ?number_of_47) WHERE { wd:Q754837 p:<P40:child> [ ps:<P40:child> ?P40_8 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many wives did Roman Emperor Vitellius have?\nEntities: [{'ID': 'Q1417', 'Label': 'Vitellius', 'Description': 'Roman emperor (15-69)', 'Probability': 0.962}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?P26_8) AS ?number_of_112) WHERE { wd:Q1417 p:<P26:spouse> [ ps:<P26:spouse> ?P26_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the director of Scarface?\nEntities: [{'ID': 'Q47075', 'Label': 'Scarface', 'Description': '1983 film directed by Brian De Palma', 'Probability': 0.4427}, {'ID': 'Q708158', 'Label': 'Scarface', 'Description': 'American rapper from Texas', 'Probability': 0.3669}, {'ID': 'Q471306', 'Label': 'Scarface', 'Description': '1932 American gangster film', 'Probability': 0.1161}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P57_8 ?label WHERE { wd:Q47075 p:<P57:director> [ ps:<P57:director> ?P57_8 ] . ?P57_8 rdfs:label ?label .}\n"
        }