{
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Toxic by Britney Spears come out before 2004?\nEntities: [{'ID': 'Q274160', 'Label': 'toxicity', 'Description': 'degree to which a substance or phenomenon can damage an organism', 'Probability': 0.6702}, {'ID': 'Q379751', 'Label': 'Toxic', 'Description': '2004 single by Britney Spears', 'Probability': 0.1625}, {'ID': 'Q11975', 'Label': 'Britney Spears', 'Description': 'American pop singer (born 1981)', 'Probability': 0.9985}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P577_8 ?expr_94 WHERE { wd:Q379751 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND ((year(?P577_8) < \"2004\"^^xsd:integer) AS ?expr_94) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the largest city in South Korea by population?\nEntities: [{'ID': 'Q884', 'Label': 'South Korea', 'Description': 'country in East Asia', 'Probability': 0.9206}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q515_1 ?P1082_38 WHERE { ?Q515_1 wdt:P31 wd:Q515 . ?Q515_1 p:<P17:country> [ ps:<P17:country> wd:Q884 ] . ?Q515_1 p:<P1082:population> [ ps:<P1082:population> ?P1082_38 ] . } ORDER BY DESC(?P1082_38) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Bohemian Rhapsody come out before 1980?\nEntities: [{'ID': 'Q187745', 'Label': 'Bohemian Rhapsody', 'Description': '1975 Queen song written and composed by Freddie Mercury', 'Probability': 0.7087}, {'ID': 'Q27894574', 'Label': 'Bohemian Rhapsody', 'Description': '2018 film directed by Bryan Singer', 'Probability': 0.2748}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 WHERE { wd:Q187745 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . FILTER ( (\"1975\"^^xsd:integer < \"1980\"^^xsd:integer) ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did the Little Prince come out before 1950?\nEntities: [{'ID': 'Q25338', 'Label': 'The Little Prince', 'Description': '1943 novella by Antoine de Saint-Exup\u00e9ry', 'Probability': 0.4118}, {'ID': 'Q6651420', 'Label': 'Little Prince', 'Description': 'Muscogee leader', 'Probability': 0.1471}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P577_8 ?expr_135 WHERE { wd:Q25338 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_135) FILTER ( xsd:double(str(?expr_135)) <= 1950 ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the first movie released featuring the character Jack Ryan?\nEntities: [{'ID': 'Q1068314', 'Label': 'Jack Ryan', 'Description': 'fictional character created by Tom Clancy', 'Probability': 0.4739}, {'ID': 'Q6084854', 'Label': 'Jack Ryan', 'Description': 'American investment banker and politician', 'Probability': 0.1261}, {'ID': 'Q27062250', 'Label': 'Jack Ryan', 'Description': 'American television series', 'Probability': 0.1174}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P577_38 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P674:characters> [ ps:<P674:characters> wd:Q1068314 ] . ?Q11424_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_38 ] . } ORDER BY ASC(?P577_38) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was born in 1963 and won six championships in the NBA?\nEntities: [{'ID': 'Q7817', 'Label': 'World Health Organization', 'Description': 'specialized agency of the United Nations that is concerned with international public health', 'Probability': 0.8514}, {'ID': 'Q155223', 'Label': 'National Basketball Association', 'Description': 'North American professional sports league', 'Probability': 0.9703}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> wd:Q18419 ] . ?Q5_1 p:<P106:occupation> [ ps:<P106:occupation> wd:Q3665646 ] . ?Q5_1 p:<P166:award_received> [ ps:<P166:award_received> wd:Q222047 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by Darren Aronofsky and starred Rachel Weisz?\nEntities: [{'ID': 'Q192762', 'Label': 'Darren Aronofsky', 'Description': 'American filmmaker', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q134077 ] . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q192762 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Fifty Shades of Grey come out before 2000?\nEntities: [{'ID': 'Q557867', 'Label': 'Fifty Shades of Grey', 'Description': '2011 erotic romance novel', 'Probability': 0.5121}, {'ID': 'Q14566553', 'Label': 'Fifty Shades of Grey', 'Description': '2015 film directed by Sam Taylor-Johnson', 'Probability': 0.4493}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_94 WHERE { wd:Q557867 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_94) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Avengers: Endgame have a bigger budget than Avengers: Infinity War?\nEntities: [{'ID': 'Q23781155', 'Label': 'Avengers: Endgame', 'Description': '2019 film directed by Anthony and Joe Russo', 'Probability': 1.0}, {'ID': 'Q23780914', 'Label': 'Avengers: Infinity War', 'Description': '2018 film directed by Anthony and Joe Russo', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P2130_16WHERE { wd:Q23781155 p:<P2130:cost> [ ps:<P2130:cost> ?P2130_16 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Pirates of the Caribbean movie made the least money?\nEntities: [{'ID': 'Q384426', 'Label': 'Pirates of the Caribbean', 'Description': 'Disney amusement franchise', 'Probability': 0.3834}, {'ID': 'Q194318', 'Label': 'Pirates of the Caribbean', 'Description': 'Series of fantasy adventure films', 'Probability': 0.3791}, {'ID': 'Q1713564', 'Label': 'Pirates of the Caribbean', 'Description': 'dark ride type at Disney theme parks', 'Probability': 0.1721}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P2142_12 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q194318 ] . ?Q11424_8 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_12 ] . } ORDER BY ASC(?P2142_12) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What Harry Potter movie made the most money?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2142_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q216930 ] . ?Q11424_349 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_353 ] . } ORDER BY DESC(?P2142_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How old is Christian Slater?\nEntities: [{'ID': 'Q204590', 'Label': 'Christian Slater', 'Description': 'American actor', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P569_8 ?expr_94WHERE { wd:Q204590 p:<P569:date_of_birth> [ ps:<P569:date_of_birth> ?P569_8 ] .BIND ((\"2023\"^^xsd:integer - year(?P569_8)) AS ?expr_94) }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie had a higher lifetime gross, Jurassic World or The Lion King?\nEntities: [{'ID': 'Q3512046', 'Label': 'Jurassic World', 'Description': '2015 film directed by Colin Trevorrow', 'Probability': 0.9455}, {'ID': 'Q36479', 'Label': 'The Lion King', 'Description': '1994 American animated film', 'Probability': 0.4872}, {'ID': 'Q1195106', 'Label': 'The Lion King', 'Description': '1997 stage musical with music by Elton John, lyrics by Tim Rice, and book by Roger Allers and Irene Mecchi', 'Probability': 0.3846}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P2142_16WHERE { wd:Q3512046 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_16 ; n1:P3005 wd:Q13780930 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When was Diablo released?\nEntities: [{'ID': 'Q220960', 'Label': 'Diablo', 'Description': '1997 video game', 'Probability': 0.3835}, {'ID': 'Q44165', 'Label': 'Diablo', 'Description': 'video game series initially developed by Blizzard North and continued by Blizzard Entertainment', 'Probability': 0.2005}, {'ID': 'Q1207986', 'Label': 'Diablo', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.1103}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 WHERE { wd:Q220960 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by Christopher Nolan and starred John David Washington?\nEntities: [{'ID': 'Q25191', 'Label': 'Christopher Nolan', 'Description': 'British\u2013American filmmaker (born 1970)', 'Probability': 0.988}, {'ID': 'Q4120019', 'Label': 'John David Washington', 'Description': 'American football player and actor (born 1984)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q25191 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q4120019 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How old is Kylie Jenner?\nEntities: [{'ID': 'Q1770624', 'Label': 'Kylie Jenner', 'Description': 'American media personality and businesswoman', 'Probability': 0.9853}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P569_8 ?expr_94WHERE { wd:Q1770624 p:<P569:date_of_birth> [ ps:<P569:date_of_birth> ?P569_8 ] .BIND ((year(\"2023-04-20\"^^xsd:date) - year(?P569_8)) AS ?expr_94) }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Academy Awards did The Father movie win?\nEntities: [{'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.9099}, {'ID': 'Q7565', 'Label': 'father', 'Description': 'male parent', 'Probability': 0.1849}, {'ID': 'Q186350', 'Label': 'God the Father', 'Description': 'in Christianity, the first of the three persons of the Trinity, who begets the Son and from whom the Holy Spirit proceeds', 'Probability': 0.1115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q19020_8) AS ?number_of_47) WHERE { ?Q19020_8 wdt:P31 wd:Q19020 . wd:Q65066669 p:<P166:award_received> [ ps:<P166:award_received> ?Q19020_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many oceans of the world?\nEntities: [{'ID': 'Q9430', 'Label': 'ocean', 'Description': 'very large body of saline water', 'Probability': 0.77}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q9430_181 WHERE { ?Q9430_181 wdt:P31 wd:Q9430 . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which James Bond actor is no longer alive?\nEntities: [{'ID': 'Q844', 'Label': 'James Bond', 'Description': 'series of books about a British spy', 'Probability': 0.8176}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q11424_10 ?P161_14 ?P570_52 WHERE { ?Q11424_10 wdt:P31 wd:Q11424 . ?Q11424_10 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q2484680 ] . ?Q11424_10 p:<P161:cast_member> [ ps:<P161:cast_member> ?P161_14 ; n1<P453:character_role> wd:Q2009573 ] . ?P161_14 p:<P570:date_of_death> [ ps:<P570:date_of_death> ?P570_52 ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Men In Black movies are there?\nEntities: [{'ID': 'Q51416', 'Label': 'Men in Black', 'Description': '1997 science fiction film directed by Barry Sonnenfeld', 'Probability': 0.4507}, {'ID': 'Q51410', 'Label': 'Men in black', 'Description': 'supposed government agents dressed in black suits who threaten UFO witnesses to keep them silent', 'Probability': 0.1946}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_8) AS ?number_of_45) WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q3305670 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Blackpink members were not from South Korea?\nEntities: [{'ID': 'Q25056945', 'Label': 'Blackpink', 'Description': 'South Korean girl group', 'Probability': 0.9755}, {'ID': 'Q884', 'Label': 'South Korea', 'Description': 'country in East Asia', 'Probability': 0.9206}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P463_8 ?P19_46 WHERE { ?P463_8 p:<P463:member_of> [ ps:<P463:member_of> wd:Q25056945 ] . ?P463_8 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> ?P19_46 ] . FILTER ( NOT EXISTS { ?P19_46 p:<P17:country> [ ps:<P17:country> wd:Q884 ] . } ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many continents of the world?\nEntities: [{'ID': 'Q5107', 'Label': 'continent', 'Description': 'large landmass identified by convention', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q5107_39) AS ?number_of_76) WHERE { ?Q5107_39 wdt:P31 wd:Q5107 . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who ran for president in 2008 and was from Chicago, Illinois?\nEntities: [{'ID': 'Q1297', 'Label': 'Chicago', 'Description': 'city and county seat of Cook County, Illinois, United States of America', 'Probability': 0.9105}, {'ID': 'Q1204', 'Label': 'Illinois', 'Description': 'state of the United States of America', 'Probability': 0.9224}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . wd:Q45578 p:<P726:candidate> [ ps:<P726:candidate> ?Q5_1 ] . ?Q5_1 p:<P551:residence> [ ps:<P551:residence> wd:Q1297 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who won Super Bowl 15?\nEntities: [{'ID': 'Q766921', 'Label': 'Super Bowl XV', 'Description': '1981 edition of the Super Bowl', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q17156793_8 ?P31_45WHERE { ?Q17156793_8 wdt:P31 wd:Q17156793 .?P31_45 p:<P1346:winner> [ ps:<P1346:winner> ?Q17156793_8 ] .?P31_45 p:<P31:instance_of> [ ps:<P31:instance_of> wd:Q32096 ] .FILTER ( ?P31_45 = wd:Q766921 ) }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What year was the first Jurassic Park movie released?\nEntities: [{'ID': 'Q167726', 'Label': 'Jurassic Park', 'Description': '1993 film directed by Steven Spielberg', 'Probability': 0.5498}, {'ID': 'Q2336369', 'Label': 'Jurassic Park', 'Description': 'American science fiction media franchise', 'Probability': 0.2525}, {'ID': 'Q756866', 'Label': 'Jurassic Park', 'Description': '1990 science fiction novel by Michael Crichton', 'Probability': 0.102}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_15 ?expr_101 WHERE { wd:Q2336369 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_15 ] . BIND (year(?P577_15) AS ?expr_101) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When did Al Pacino get his first Oscar?\nEntities: [{'ID': 'Q41163', 'Label': 'Al Pacino', 'Description': 'American actor (born 1940)', 'Probability': 1.0}, {'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.6452}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P585_46 ?expr_132 WHERE { wd:Q103916 p:<P1346:winner> [ ps:<P1346:winner> wd:Q41163 ; n1<P585:point_in_time> ?P585_46 ] . BIND (year(?P585_46) AS ?expr_132) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was Kentucky's first governor?\nEntities: [{'ID': 'Q1603', 'Label': 'Kentucky', 'Description': 'state of the United States of America', 'Probability': 0.8593}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?P580_9 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ ps:<P39:position_held> wd:Q4151335 ; n1<P580:start_time> ?P580_9 ] . } ORDER BY ASC(?P580_9) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who is the youngest current US governor?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.9022}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_227 WHERE { ?Q5_227 wdt:P31 n1:Q5 . ?Q5_227 wdt:P569 ?P569_8 . ?Q5_227 wdt:P39 ?P39_219 . ?P39_219 wdt:P17 n1:Q30 . ?P39_219 wdt:P279 n1:Q889821 . } ORDER BY DESC(?P569_8) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many wives did Woodrow Wilson have?\nEntities: [{'ID': 'Q34296', 'Label': 'Woodrow Wilson', 'Description': 'president of the United States from 1913 to 1921', 'Probability': 0.9876}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (count(?P26_8) as ?count) WHERE { wd:Q34296 p:<P26:spouse> [ ps:<P26:spouse> ?P26_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the second book in the Eragon series called?\nEntities: [{'ID': 'Q239296', 'Label': 'Eragon', 'Description': '2006 film directed by Stefen Fangmeier', 'Probability': 0.5306}, {'ID': 'Q185449', 'Label': 'Eragon', 'Description': '2002 novel by Christopher Paolini', 'Probability': 0.3776}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ n2<P1545:series_ordinal> \"2\" ; ps:<P179:part_of_the_series> wd:Q2699024 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many James Bond movies has Daniel Craig done?\nEntities: [{'ID': 'Q844', 'Label': 'James Bond', 'Description': 'series of books about a British spy', 'Probability': 0.8176}, {'ID': 'Q4547', 'Label': 'Daniel Craig', 'Description': 'English actor', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?thing_8 WHERE { ?thing_8 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q4547 ] . ?thing_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q2484680 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actor was both Indiana Jones and Han Solo?\nEntities: [{'ID': 'Q2562640', 'Label': 'Indiana Jones', 'Description': \"entertainment franchise originating in the 80's\", 'Probability': 0.5413}, {'ID': 'Q148659', 'Label': 'Indiana Jones', 'Description': 'fictional archaeologist', 'Probability': 0.4196}, {'ID': 'Q51802', 'Label': 'Han Solo', 'Description': 'fictional character from Star Wars', 'Probability': 0.9786}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q5_8 ?Q11424_45 WHERE { ?Q5_8 wdt:P31 wd:Q5 . ?Q11424_45 wdt:P31 wd:Q11424 . ?Q11424_45 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_8 ] . ?Q11424_45 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q98018448 ] . wd:Q51802 p:<P175:performer> [ ps:<P175:performer> ?Q5_8 ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Thor movie from the original trilogy does not star Natalie Portman?\nEntities: [{'ID': 'Q717588', 'Label': 'Thor', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.3559}, {'ID': 'Q42952', 'Label': 'Thor', 'Description': 'hammer-wielding Nordic god associated with thunder, lightning, storms, oaks, strength, and fertility', 'Probability': 0.3037}, {'ID': 'Q37876', 'Label': 'Natalie Portman', 'Description': 'American actress and filmmaker', 'Probability': 0.9943}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_311 WHERE { ?Q11424_311 wdt:P31 wd:Q11424 . ?Q11424_311 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q88306753 ] . FILTER ( NOT EXISTS { ?Q11424_311 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q37876 ] . } ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 11th president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"11\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many members were in NSYNC?\nEntities: [{'ID': 'Q154454', 'Label': 'NSYNC', 'Description': 'American boy band', 'Probability': 0.992}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?P527_8) AS ?number_of_46) WHERE { wd:Q154454 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the fourth installment to the Matrix series called?\nEntities: [{'ID': 'Q44337', 'Label': 'matrix', 'Description': 'rectangular array of numbers, symbols, or expressions, arranged in rows and columns', 'Probability': 0.5091}, {'ID': 'Q1463013', 'Label': 'matrix', 'Description': 'geological term for the mass of material in which larger grains, crystals or clasts are embedded', 'Probability': 0.1259}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"4\" ; ps:<P179:part_of_the_series> wd:Q1210827 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who played Detective Rick Deckard in Blade Runner?\nEntities: [{'ID': 'Q943048', 'Label': 'Rick Deckard', 'Description': 'fictional character from Blade Runner', 'Probability': 1.0}, {'ID': 'Q184843', 'Label': 'Blade Runner', 'Description': '1982 film by Ridley Scott', 'Probability': 0.9113}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P161_8 WHERE { wd:Q184843 p:<P161:cast_member> [ n1<P453:character_role> wd:Q943048 ; ps:<P161:cast_member> ?P161_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the first Harry Potter book?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 ?P1545_3 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q8337 ; n1<P1545:series_ordinal> ?P1545_3 ] . } ORDER BY ASC(?P1545_3) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Rambo movies has Sylvester Stallone appeared in?\nEntities: [{'ID': 'Q1621266', 'Label': 'Rambo', 'Description': 'film series', 'Probability': 0.2984}, {'ID': 'Q951317', 'Label': 'John Rambo', 'Description': 'fictional character in the Rambo franchise', 'Probability': 0.2124}, {'ID': 'Q159870', 'Label': 'Rambo', 'Description': '2008 film directed by Sylvester Stallone', 'Probability': 0.1156}, {'ID': 'Q40026', 'Label': 'Sylvester Stallone', 'Description': 'American actor and film director', 'Probability': 0.999}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_159) AS ?number_of_196) WHERE { ?Q11424_159 wdt:P31 wd:Q11424 . ?Q11424_159 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q1621266 ] . ?Q11424_159 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q40026 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actor is taller, The Rock or Terry Crews?\nEntities: [{'ID': 'Q11399', 'Label': 'rock music', 'Description': 'popular music genre', 'Probability': 0.8814}, {'ID': 'Q271464', 'Label': 'Terry Crews', 'Description': 'American actor and football player (born 1968)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P2048_16WHERE { wd:Q271464 p:<P2048:height> [ ps:<P2048:height> ?P2048_16 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What team won the first Super Bowl?\nEntities: [{'ID': 'Q32096', 'Label': 'Super Bowl', 'Description': 'National Football League (NFL) championship game', 'Probability': 0.8712}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q17156793_8 ?P31_45 ?P585_49WHERE { ?Q17156793_8 wdt:P31 wd:Q17156793 .?P31_45 p:<P1346:winner> [ ps:<P1346:winner> ?Q17156793_8 ] .?P31_45 p:<P31:instance_of> [ ps:<P31:instance_of> wd:Q32096 ] .?P31_45 p:<P585:point_in_time> [ ps:<P585:point_in_time> ?P585_49 ] . }ORDER BY ASC(?P585_49)LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the third Lord of The Rings movie?\nEntities: [{'ID': 'Q15228', 'Label': 'The Lord of the Rings', 'Description': '1954\u20131955 fantasy novel by J. R. R. Tolkien', 'Probability': 0.5616}, {'ID': 'Q190214', 'Label': 'The Lord of the Rings trilogy', 'Description': '2001-2003 three films directed by Peter Jackson', 'Probability': 0.2414}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"3\" ; ps:<P179:part_of_the_series> wd:Q190214 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many movies has Chris Evans been in?\nEntities: [{'ID': 'Q2964710', 'Label': 'Chris Evans', 'Description': 'English television and radio presenter', 'Probability': 0.4677}, {'ID': 'Q178348', 'Label': 'Chris Evans', 'Description': 'American actor', 'Probability': 0.3548}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_8) AS ?number_of_45) WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q178348 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the first James Bond movie?\nEntities: [{'ID': 'Q844', 'Label': 'James Bond', 'Description': 'series of books about a British spy', 'Probability': 0.8176}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P577_5 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q2484680 ] . ?Q11424_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_5 ] . } ORDER BY ASC(?P577_5) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many albums have the Young Marble Giants released?\nEntities: [{'ID': 'Q2164036', 'Label': 'Young Marble Giants', 'Description': 'Welsh post-punk band', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q482994_1) AS ?number_of_37) WHERE { ?Q482994_1 wdt:P31 wd:Q482994 . ?Q482994_1 p:<P175:performer> [ ps:<P175:performer> wd:Q2164036 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Iron Man movie did Jeff Bridges not appear in?\nEntities: [{'ID': 'Q180704', 'Label': 'Iron Man', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.6095}, {'ID': 'Q192724', 'Label': 'Iron Man', 'Description': '2008 film directed by Jon Favreau', 'Probability': 0.1488}, {'ID': 'Q174843', 'Label': 'Jeff Bridges', 'Description': 'American actor', 'Probability': 0.9836}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q16642701 ] . FILTER ( NOT EXISTS { ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q174843 ] . } ) }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is Deadpool's real name?\nEntities: [{'ID': 'Q1631090', 'Label': 'Deadpool', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.7055}, {'ID': 'Q19347291', 'Label': 'Deadpool', 'Description': '2016 film directed by Tim Miller', 'Probability': 0.2687}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P1477_8WHERE { wd:Q1631090 p:<P1477:birth_name> [ ps:<P1477:birth_name> ?P1477_8 ] . }LIMIT 200\n"
        }