{
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the title of the third Matrix movie?\nEntities: [{'ID': 'Q44337', 'Label': 'matrix', 'Description': 'rectangular array of numbers, symbols, or expressions, arranged in rows and columns', 'Probability': 0.5091}, {'ID': 'Q1463013', 'Label': 'matrix', 'Description': 'geological term for the mass of material in which larger grains, crystals or clasts are embedded', 'Probability': 0.1259}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P1476_39 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q1210827 ; n1<P1545:series_ordinal> \"3\" ] . ?Q11424_1 p:<P1476:title> [ ps:<P1476:title> ?P1476_39 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What year was Fallout 3 released?\nEntities: [{'ID': 'Q221164', 'Label': 'Fallout 3', 'Description': '2008 action role-playing video game', 'Probability': 0.9613}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_237 WHERE { wd:Q221164 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_237) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Transformers movie is the longest?\nEntities: [{'ID': 'Q1323565', 'Label': 'Transformers', 'Description': 'Japanese\u2013American media franchise', 'Probability': 0.354}, {'ID': 'Q171453', 'Label': 'Transformers', 'Description': '2007 film directed by Michael Bay', 'Probability': 0.2718}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2047_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q2073466 ] . ?Q11424_349 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_353 ] . } ORDER BY DESC(?P2047_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Spider-Man movie made the most money?\nEntities: [{'ID': 'Q79037', 'Label': 'Spider-Man', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.3261}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q11424_24 ?P2142_29 WHERE { ?Q11424_24 wdt:P31 wd:Q11424 . ?Q11424_24 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q18636789 ] . ?Q11424_24 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_29 ; n1:P3005 wd:Q13780930 ] . } ORDER BY DESC(?P2142_29) LIMIT  1 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the first woman Senator?\nEntities: [{'ID': 'Q467', 'Label': 'woman', 'Description': 'female adult human', 'Probability': 1.0}, {'ID': 'Q4416090', 'Label': 'United States senator', 'Description': 'member of the United States Senate', 'Probability': 0.84}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?P580_9 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ ps:<P39:position_held> wd:Q4416090 ; n2<P580:start_time> ?P580_9 ] . ?Q5_1 p:<P21:sex_or_gender> [ ps:<P21:sex_or_gender> wd:Q6581072 ] . } ORDER BY ASC(?P580_9) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When was the last eruption of Mount Vesuvius?\nEntities: [{'ID': 'Q524', 'Label': 'Mount Vesuvius', 'Description': 'volcano on the southwestern coast of Italy', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P580_46 WHERE { wd:Q524 p:<P793:significant_event> [ ps:<P793:significant_event> ?P793_8 ] . ?P793_8 p:<P580:start_time> [ ps:<P580:start_time> ?P580_46 ] . }ORDER BY asc (?P793_8) LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did The Chordettes' Mr. Sandman come out before 1955?\nEntities: [{'ID': 'Q1364592', 'Label': 'The Chordettes', 'Description': 'American female popular singing quartet', 'Probability': 1.0}, {'ID': 'Q1049890', 'Label': 'Sandman', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.323}, {'ID': 'Q827099', 'Label': 'The Sandman', 'Description': 'comic series by Neil Gaiman', 'Probability': 0.1947}, {'ID': 'Q627323', 'Label': 'Sandman', 'Description': 'mythical character', 'Probability': 0.1173}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P577_8 WHERE { wd:Q931296 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . FILTER ( (year(?P577_8) < \"1955\"^^xsd:integer) ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Was The Ring released before 2005?\nEntities: [{'ID': 'Q161172', 'Label': 'ring', 'Description': 'algebraic structure in mathematics, not necessarily with multiplicative identity', 'Probability': 0.2489}, {'ID': 'Q7334807', 'Label': 'Ring of bells', 'Description': 'Arrangement of percussion instruments optimized for swinging in a circle to create peals', 'Probability': 0.1361}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_94 WHERE { wd:Q212804 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_94) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What year was Tupac Shakur killed?\nEntities: [{'ID': 'Q6107', 'Label': 'Tupac Shakur', 'Description': 'American rapper (1971\u20131996)', 'Probability': 0.9937}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P570_8 ?expr_180 WHERE { wd:Q6107 p:<P570:date_of_death> [ ps:<P570:date_of_death> ?P570_8 ] . BIND (year(?P570_8) AS ?expr_180) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Marvel movie made the most money?\nEntities: [{'ID': 'Q173496', 'Label': 'Marvel Comics', 'Description': 'company that publishes comic books and related media', 'Probability': 0.6464}, {'ID': 'Q1200552', 'Label': 'Marvel Entertainment', 'Description': 'American entertainment company', 'Probability': 0.1076}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P2142_13 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q642878 ] . ?Q11424_8 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_13 ] . } ORDER BY DESC(?P2142_13) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the last Harry Potter book?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 ?P1545_3 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q8337 ; n1<P1545:series_ordinal> ?P1545_3 ] . } ORDER BY DESC(?P1545_3) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Academy Awards has Clint Eastwood won for directing?\nEntities: [{'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.9099}, {'ID': 'Q43203', 'Label': 'Clint Eastwood', 'Description': 'American actor and film director (born 1930)', 'Probability': 0.9697}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?P1686_2) AS ?number_of_106) WHERE { ?P1686_2 wdt:P31 wd:Q11424 . wd:Q43203 p:<P166:award_received> [ ps:<P166:award_received> wd:Q103360 ; n1<P1686:for_work> ?P1686_2 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actor played James Bond and was from Ireland?\nEntities: [{'ID': 'Q844', 'Label': 'James Bond', 'Description': 'series of books about a British spy', 'Probability': 0.8176}, {'ID': 'Q22890', 'Label': 'Ireland', 'Description': 'island in the North Atlantic Ocean', 'Probability': 0.5546}, {'ID': 'Q27', 'Label': 'Republic of Ireland', 'Description': 'country in Northwestern Europe', 'Probability': 0.2651}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . wd:Q151472 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . ?Q5_1 p:<P27:country_of_citizenship> [ ps:<P27:country_of_citizenship> wd:Q27 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the first female vice president of America?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.5665}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?P580_9 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ ps:<P39:position_held> wd:Q11699 ; n1<P580:start_time> ?P580_9 ] . ?Q5_1 p:<P21:sex_or_gender> [ ps:<P21:sex_or_gender> wd:Q6581072 ] . } ORDER BY ASC(?P580_9) LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 1st president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"1\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Captain America movies has Chris Evans starred in?\nEntities: [{'ID': 'Q190679', 'Label': 'Captain America', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.7417}, {'ID': 'Q25221879', 'Label': 'Captain America', 'Description': 'name of several comic books about the character Captain America', 'Probability': 0.1275}, {'ID': 'Q2964710', 'Label': 'Chris Evans', 'Description': 'English television and radio presenter', 'Probability': 0.4677}, {'ID': 'Q178348', 'Label': 'Chris Evans', 'Description': 'American actor', 'Probability': 0.3548}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_159) AS ?number_of_196) WHERE { ?Q11424_159 wdt:P31 wd:Q11424 . ?Q11424_159 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q17385223 ] . ?Q11424_159 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q178348 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which members of 98 Degrees were not born in Ohio?\nEntities: [{'ID': 'Q277230', 'Label': '98 Degrees', 'Description': 'American boy band', 'Probability': 0.9602}, {'ID': 'Q1397', 'Label': 'Ohio', 'Description': 'state of the United States of America', 'Probability': 0.9365}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P527_4 ?P19_42 WHERE { wd:Q277230 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_4 ] . ?P527_4 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> ?P19_42 ] . FILTER ( NOT EXISTS { ?P19_42 p:<P131:located_in_the_administrative_territorial_entity> [ ps:<P131:located_in_the_administrative_territorial_entity> ?P131_145 ] . ?P131_145 p:<P131:located_in_the_administrative_territorial_entity> [ ps:<P131:located_in_the_administrative_territorial_entity> wd:Q1397 ] . } ) }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Is Kamala Harris older than Barack Obama?\nEntities: [{'ID': 'Q10853588', 'Label': 'Kamala Harris', 'Description': 'vice president of the United States since 2021', 'Probability': 0.9984}, {'ID': 'Q76', 'Label': 'Barack Obama', 'Description': 'president of the United States from 2009 to 2017', 'Probability': 0.997}]\n\n###\n\n",
            "completion": "ASK WHERE { wd:Q10853588 p:<P569:date_of_birth> [ ps:<P569:date_of_birth> ?P569_7 ] . wd:Q76 p:<P569:date_of_birth> [ ps:<P569:date_of_birth> ?P569_8 ] . BIND(year(xsd:dateTime(?P569_8)) as ?year) BIND(year(xsd:dateTime(?P569_7)) as ?year1) FILTER(?year > ?year1) }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Harry Potter film is the longest?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P2047_12 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q216930 ] . ?Q11424_8 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_12 ] . } ORDER BY DESC(?P2047_12) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Dirty Harry movies are there?\nEntities: [{'ID': 'Q110206', 'Label': 'Dirty Harry', 'Description': '1971 film directed by Don Siegel', 'Probability': 0.7246}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_1) AS ?number_of_38) WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q2712648 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When did the third Twilight book come out?\nEntities: [{'ID': 'Q160071', 'Label': 'Twilight', 'Description': '2008 film directed by Catherine Hardwicke', 'Probability': 0.2113}, {'ID': 'Q164160', 'Label': 'twilight', 'Description': \"illumination of the Earth's lower atmosphere when the Sun itself is not directly visible because it is below the horizon\", 'Probability': 0.1569}, {'ID': 'Q44523', 'Label': 'Twilight', 'Description': 'series of vampire romance novels by Stephenie Meyer', 'Probability': 0.1133}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 ?P577_37 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ n2<P1545:series_ordinal> \"3\" ; ps:<P179:part_of_the_series> wd:Q44523 ] . ?Q7725634_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_37 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Is the Missouri River longer than the Mississippi River?\nEntities: [{'ID': 'Q5419', 'Label': 'Missouri River', 'Description': 'major river in central United States', 'Probability': 0.9991}, {'ID': 'Q1497', 'Label': 'Mississippi River', 'Description': 'largest river system in North America', 'Probability': 0.9935}]\n\n###\n\n",
            "completion": "ASK WHERE { wd:Q5419 p:<P2043:length> [ ps:<P2043:length> ?P2043_8 ] . wd:Q1497 p:<P2043:length> [ ps:<P2043:length> ?P2043_7 ] . FILTER(?P2043_8 > ?P2043_7) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 30th president?\nEntities: [{'ID': 'Q11696', 'Label': 'President of the United States', 'Description': 'head of state and head of government of the United States of America', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"30\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which country has a larger population, Haiti or Benin?\nEntities: [{'ID': 'Q790', 'Label': 'Haiti', 'Description': 'island sovereign state in the Caribbean Sea', 'Probability': 0.9124}, {'ID': 'Q962', 'Label': 'Benin', 'Description': 'sovereign state in West Africa', 'Probability': 0.914}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P1082_16WHERE { wd:Q962 p:<P1082:population> [ ps:<P1082:population> ?P1082_16 ; n1<P585:point_in_time> \"2017-01-01T00:00:00Z\"^^xsd:dateTime ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Indiana Jones movies has Steven Spielberg directed?\nEntities: [{'ID': 'Q2562640', 'Label': 'Indiana Jones', 'Description': \"entertainment franchise originating in the 80's\", 'Probability': 0.5413}, {'ID': 'Q148659', 'Label': 'Indiana Jones', 'Description': 'fictional archaeologist', 'Probability': 0.4196}, {'ID': 'Q8877', 'Label': 'Steven Spielberg', 'Description': 'American filmmaker (born 1946)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_159) AS ?number_of_196) WHERE { ?Q11424_159 wdt:P31 wd:Q11424 . ?Q11424_159 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q98018448 ] . ?Q11424_159 p:<P57:director> [ ps:<P57:director> wd:Q8877 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the first Pirates of the Caribbean movie?\nEntities: [{'ID': 'Q384426', 'Label': 'Pirates of the Caribbean', 'Description': 'Disney amusement franchise', 'Probability': 0.3834}, {'ID': 'Q194318', 'Label': 'Pirates of the Caribbean', 'Description': 'Series of fantasy adventure films', 'Probability': 0.3791}, {'ID': 'Q1713564', 'Label': 'Pirates of the Caribbean', 'Description': 'dark ride type at Disney theme parks', 'Probability': 0.1721}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P577_5 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q194318 ] . ?Q11424_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_5 ] . } ORDER BY ASC(?P577_5) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Nebula awards did Isaac Asimov win?\nEntities: [{'ID': 'Q42372', 'Label': 'nebula', 'Description': 'body of interstellar clouds', 'Probability': 0.5832}, {'ID': 'Q194285', 'Label': 'Nebula Award', 'Description': 'literature prize for science fiction and fantasy works from the United States', 'Probability': 0.1087}, {'ID': 'Q34981', 'Label': 'Isaac Asimov', 'Description': 'American writer and biochemist (1920\u20131992)', 'Probability': 0.9992}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q194285_8) AS ?number_of_46) WHERE { ?Q194285_8 wdt:P31 wd:Q194285 . wd:Q34981 p:<P166:award_received> [ ps:<P166:award_received> ?Q194285_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actress from Germany was in the movie Troy?\nEntities: [{'ID': 'Q183', 'Label': 'Germany', 'Description': 'country in Central Europe', 'Probability': 0.8921}, {'ID': 'Q22647', 'Label': 'Troy', 'Description': 'Homeric ancient city in northwest Asia Minor', 'Probability': 0.3058}, {'ID': 'Q600301', 'Label': 'Troy', 'Description': 'city in and county seat of Rensselaer County, New York, United States', 'Probability': 0.1541}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P27:country_of_citizenship> [ ps:<P27:country_of_citizenship> wd:Q183 ] . wd:Q186587 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Parasite come out before 2020?\nEntities: [{'ID': 'Q186517', 'Label': 'parasitism', 'Description': 'relationship between species, where one organism, the parasite, lives on or in another organism, the host, causing it some harm, and is adapted structurally to this way of life', 'Probability': 0.8203}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_93 WHERE { wd:Q61448040 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_93) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movies directed by Martin Scorsese featured Leonardo DiCaprio?\nEntities: [{'ID': 'Q41148', 'Label': 'Martin Scorsese', 'Description': 'American film director, screenwriter and producer', 'Probability': 0.9966}, {'ID': 'Q38111', 'Label': 'Leonardo DiCaprio', 'Description': 'American actor and film producer', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q41148 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q38111 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the name of the hero in The Legend of Zelda series?\nEntities: [{'ID': 'Q12393', 'Label': 'The Legend of Zelda', 'Description': 'media franchise', 'Probability': 0.8312}, {'ID': 'Q12395', 'Label': 'The Legend of Zelda', 'Description': '1986 action-adventure video game', 'Probability': 0.1039}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P674_18 WHERE { wd:Q12393 p:<P674:characters> [ ps:<P674:characters> ?P674_18 ] . ?P674_18 p:<P5800:narrative_role> [ ps:<P5800:narrative_role> wd:Q215972 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the first woman to become vice president in the United States?\nEntities: [{'ID': 'Q11699', 'Label': 'Vice President of the United States', 'Description': 'second-highest constitutional office in the United States', 'Probability': 0.7148}, {'ID': 'Q42178', 'Label': 'vice president', 'Description': 'officer in government or business', 'Probability': 0.1361}, {'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?P580_9 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ ps:<P39:position_held> wd:Q11699 ; n1<P580:start_time> ?P580_9 ] . ?Q5_1 p:<P21:sex_or_gender> [ ps:<P21:sex_or_gender> wd:Q6581072 ] . } ORDER BY ASC(?P580_9) LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which books by Jane Austen were not released after 1814?\nEntities: [{'ID': 'Q36322', 'Label': 'Jane Austen', 'Description': 'English novelist (1775\u20131817)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q7725634_1 ?P577_5 ?expr_91 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P50:author> [ ps:<P50:author> wd:Q36322 ] . ?Q7725634_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_5 ] . BIND (year(?P577_5) AS ?expr_91) FILTER ( (?expr_91 <= \"1814\"^^xsd:integer) ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who wrote the Percy Jackson series?\nEntities: [{'ID': 'Q3899725', 'Label': 'Percy Jackson', 'Description': 'fictional boy and demigod, protagonist of series Percy Jackson & the Olympians, The Heroes of Olympus and The Trials of Apollo', 'Probability': 0.7755}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?thing_8 ?P50_12WHERE { ?thing_8 p:<P138:named_after> [ ps:<P138:named_after> wd:Q3899725 ] .?thing_8 p:<P50:author> [ ps:<P50:author> ?P50_12 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which member of NSYNC appeared in the movie The Social Network?\nEntities: [{'ID': 'Q154454', 'Label': 'NSYNC', 'Description': 'American boy band', 'Probability': 0.992}, {'ID': 'Q2715623', 'Label': 'social network', 'Description': 'theoretical concept in sociology', 'Probability': 0.9079}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . wd:Q185888 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . ?Q5_1 p:<P166:award_received> [ ps:<P166:award_received> wd:Q1044427 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many games are in the Devil May Cry series?\nEntities: [{'ID': 'Q7676662', 'Label': 'Devil May Cry', 'Description': 'video game series', 'Probability': 0.7241}, {'ID': 'Q840889', 'Label': 'Devil May Cry', 'Description': '2001 video game', 'Probability': 0.2552}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q7889_1) AS ?number_of_38) WHERE { ?Q7889_1 wdt:P31 wd:Q7889 . ?Q7889_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q7676662 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Naked Gun movies are there?\nEntities: [{'ID': 'Q13476442', 'Label': 'The Naked Gun', 'Description': 'series of American crime comedy films', 'Probability': 0.8235}, {'ID': 'Q15644664', 'Label': 'Naked Gun', 'Description': '1956 movie', 'Probability': 0.1765}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_159) AS ?number_of_196) WHERE { ?Q11424_159 wdt:P31 wd:Q11424 . ?Q11424_159 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q13476442 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by the Coen brothers and starred Javier Bardem?\nEntities: [{'ID': 'Q2522178', 'Label': 'Coen', 'Description': 'town in Queensland, Australia', 'Probability': 0.6699}, {'ID': 'Q134895', 'Label': 'Javier Bardem', 'Description': 'Spanish actor', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q134895 ] . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q13595531 ] . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q13595311 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Is J. K. Rowling younger than Stephen King?\nEntities: [{'ID': 'Q34660', 'Label': 'J. K. Rowling', 'Description': 'British author and philanthropist (born 1965)', 'Probability': 1.0}, {'ID': 'Q39829', 'Label': 'Stephen King', 'Description': 'American writer (born 1947)', 'Probability': 0.9821}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P569_102 ?expr_188WHERE { wd:Q39829 p:<P569:date_of_birth> [ ps:<P569:date_of_birth> ?P569_102 ] .BIND (year(?P569_102) AS ?expr_188) }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who wrote Neuromancer?\nEntities: [{'ID': 'Q662029', 'Label': 'Neuromancer', 'Description': '1984 novel by William Gibson', 'Probability': 0.8976}, {'ID': 'Q1126146', 'Label': 'Neuromancer', 'Description': '1988 video game', 'Probability': 0.1024}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P50_8WHERE { wd:Q662029 p:<P50:author> [ ps:<P50:author> ?P50_8 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Senses Fail album came out in 2004?\nEntities: [{'ID': 'Q1474339', 'Label': 'Senses Fail', 'Description': 'American post-hardcore band', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q482994_8 WHERE { ?Q482994_8 wdt:P31 wd:Q482994 . ?Q482994_8 p:<P175:performer> [ ps:<P175:performer> wd:Q1474339 ] . ?Q482994_8 p:<P577:publication_date> [ ps:<P577:publication_date> \"2004-09-07T00:00:00Z\"^^xsd:dateTime ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Academy Awards did John Wayne win?\nEntities: [{'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.9099}, {'ID': 'Q40531', 'Label': 'John Wayne', 'Description': 'American actor (1907\u20131979)', 'Probability': 0.9826}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q19020_8) AS ?number_of_46) WHERE { ?Q19020_8 wdt:P31 wd:Q19020 . wd:Q40531 p:<P166:award_received> [ ps:<P166:award_received> ?Q19020_8 ] . } LIMIT 200\n"
        }