{
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: In which Tim Burton movie is the music not made by Danny Elfman?\nEntities: [{'ID': 'Q56008', 'Label': 'Tim Burton', 'Description': 'American filmmaker and artist', 'Probability': 0.9927}, {'ID': 'Q193338', 'Label': 'Danny Elfman', 'Description': 'American composer (born 1953)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_311 WHERE { ?Q11424_311 wdt:P31 wd:Q11424 . ?Q11424_311 p:<P57:director> [ ps:<P57:director> wd:Q56008 ] . FILTER ( NOT EXISTS { ?Q11424_311 p:<P86:composer> [ ps:<P86:composer> wd:Q193338 ] . } ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Taylor Swift album had more songs, Red or Lover?\nEntities: [{'ID': 'Q26876', 'Label': 'Taylor Swift', 'Description': 'American singer-songwriter and music producer', 'Probability': 0.9893}, {'ID': 'Q3142', 'Label': 'red', 'Description': 'color', 'Probability': 0.2586}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q482994_1 (COUNT(DISTINCT ?P658_5) AS ?number_of_43) WHERE { ?Q482994_1 wdt:P31 wd:Q482994 . ?Q482994_1 p:<P175:performer> [ ps:<P175:performer> wd:Q26876 ] . FILTER ( (  ?Q482994_1 = wd:Q858750 || ?Q482994_1 = wd:Q64596218 ) ) ?Q482994_1 p:<P658:tracklist> [ ps:<P658:tracklist> ?P658_5 ] . } GROUP BY ?Q482994_1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was Hunter Thompson's first book?\nEntities: [{'ID': 'Q219780', 'Label': 'Hunter S. Thompson', 'Description': 'American journalist and author (1937-2005)', 'Probability': 0.9565}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q47461344_1 ?P577_38 WHERE { ?Q47461344_1 wdt:P31 wd:Q47461344 . ?Q47461344_1 p:<P50:author> [ ps:<P50:author> wd:Q219780 ] . ?Q47461344_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_38 ] . } ORDER BY ASC(?P577_38) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many states are there in America?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.5665}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q35657_1) AS ?number_of_38) WHERE { ?Q35657_1 wdt:P31 wd:Q35657 . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Harry Potter movie has the longest runtime?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P2047_12 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q216930 ] . ?Q11424_8 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_12 ] . } ORDER BY DESC(?P2047_12) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the first book in the Wheel of Time series?\nEntities: [{'ID': 'Q4470', 'Label': 'The Wheel of Time', 'Description': 'series of fantasy novels by Robert Jordan', 'Probability': 0.4921}, {'ID': 'Q7992037', 'Label': 'Wheel of time', 'Description': 'religious and philosophical concept of cyclical, repeating epochs or ages', 'Probability': 0.2063}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ n2<P1545:series_ordinal> \"1\" ; ps:<P179:part_of_the_series> wd:Q4470 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which of the Pirates of the Caribbean movies is the longest?\nEntities: [{'ID': 'Q384426', 'Label': 'Pirates of the Caribbean', 'Description': 'Disney amusement franchise', 'Probability': 0.3834}, {'ID': 'Q194318', 'Label': 'Pirates of the Caribbean', 'Description': 'Series of fantasy adventure films', 'Probability': 0.3791}, {'ID': 'Q1713564', 'Label': 'Pirates of the Caribbean', 'Description': 'dark ride type at Disney theme parks', 'Probability': 0.1721}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2047_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q194318 ] . ?Q11424_349 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_353 ] . } ORDER BY DESC(?P2047_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which video game sold the most of all time?\nEntities: [{'ID': 'Q7889', 'Label': 'video game', 'Description': 'electronic game with user interface and visual feedback?', 'Probability': 0.9943}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7889_1 ?P2664_38 WHERE { ?Q7889_1 wdt:P31 wd:Q7889 . ?Q7889_1 p:<P2664:units_sold> [ ps:<P2664:units_sold> ?P2664_38 ] . } ORDER BY DESC(?P2664_38) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the third Thor movie to be released?\nEntities: [{'ID': 'Q717588', 'Label': 'Thor', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.3559}, {'ID': 'Q42952', 'Label': 'Thor', 'Description': 'hammer-wielding Nordic god associated with thunder, lightning, storms, oaks, strength, and fertility', 'Probability': 0.3037}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P179_7 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> ?P179_7 ; n1<P1545:series_ordinal> \"3\" ] . FILTER ( ?P179_7 = wd:Q88306753 ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Zelda games have come out on Switch?\nEntities: [{'ID': 'Q12393', 'Label': 'The Legend of Zelda', 'Description': 'media franchise', 'Probability': 0.3481}, {'ID': 'Q187324', 'Label': 'Zelda Fitzgerald', 'Description': 'novelist, wife of F. Scott Fitzgerald (1900-1948)', 'Probability': 0.1456}, {'ID': 'Q1067046', 'Label': 'Princess Zelda', 'Description': 'video game character', 'Probability': 0.1076}, {'ID': 'Q5320', 'Label': 'electrical switch', 'Description': 'electrical component that can break an electrical circuit', 'Probability': 0.2652}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q7889_1) AS ?number_of_74) WHERE { ?Q7889_1 wdt:P31 wd:Q7889 . ?Q7889_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q12393 ] . ?Q7889_1 p:<P2664:units_sold> [ ps:<P2664:units_sold> ?P2664_38 ; n1<P400:platform> wd:Q19610114 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Scream come out before 2000?\nEntities: [{'ID': 'Q27411', 'Label': 'Scream', 'Description': '1996 film directed by Wes Craven', 'Probability': 0.214}, {'ID': 'Q300968', 'Label': 'Scream / Childhood', 'Description': '1995 single by Michael Jackson and Janet Jackson', 'Probability': 0.1081}, {'ID': 'Q18645277', 'Label': 'Scream', 'Description': '2015 American horror television series', 'Probability': 0.1059}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_15 ?expr_101 WHERE { wd:Q27411 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_15 ] . BIND (year(?P577_15) AS ?expr_101) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie starred both Norm MacDonald and Artie Lange?\nEntities: [{'ID': 'Q1371229', 'Label': 'Norm Macdonald', 'Description': 'Canadian comedian (1959\u20132021)', 'Probability': 0.9337}, {'ID': 'Q712452', 'Label': 'Artie Lange', 'Description': 'American comedian', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q1371229 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q712452 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the first Indiana Jones movie chronologically?\nEntities: [{'ID': 'Q2562640', 'Label': 'Indiana Jones', 'Description': \"entertainment franchise originating in the 80's\", 'Probability': 0.5413}, {'ID': 'Q148659', 'Label': 'Indiana Jones', 'Description': 'fictional archaeologist', 'Probability': 0.4196}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P577_5 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P674:characters> [ ps:<P674:characters> wd:Q148659 ] . ?Q11424_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_5 ] . } ORDER BY ASC(?P577_5) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by Denis Villeneuve and stars Timothee Chalamet?\nEntities: [{'ID': 'Q548823', 'Label': 'Denis Villeneuve', 'Description': 'Canadian film director and screenwriter', 'Probability': 1.0}, {'ID': 'Q19877770', 'Label': 'Timoth\u00e9e Chalamet', 'Description': 'French-American actor (born 1995)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q548823 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q19877770 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Hobbit moves are there?\nEntities: [{'ID': 'Q74359', 'Label': 'Hobbit', 'Description': \"fictional race from J. R. R. Tolkien's legendarium\", 'Probability': 0.8212}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_1) AS ?number_of_75) WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q74331 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which MCU movie comes first chronologically?\nEntities: [{'ID': 'Q642878', 'Label': 'Marvel Cinematic Universe', 'Description': 'shared fictional universe', 'Probability': 0.3559}, {'ID': 'Q165678', 'Label': 'microcontroller', 'Description': 'small computer on a single integrated circuit', 'Probability': 0.3051}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q11424_113 WHERE { ?Q11424_113 wdt:P31 wd:Q11424 . ?Q11424_113 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"1\" ; ps:<P179:part_of_the_series> wd:Q642878 ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many mountains in Mexico are more than 15,000 feet in elevation?\nEntities: [{'ID': 'Q96', 'Label': 'Mexico', 'Description': 'country in North America', 'Probability': 0.9086}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q8502_1 ?P2044_5 WHERE { ?Q8502_1 wdt:P31 wd:Q8502 . ?Q8502_1 p:<P17:country> [ ps:<P17:country> wd:Q96 ] . ?Q8502_1 p:<P2044:elevation_above_sea_level> [ ps:<P2044:elevation_above_sea_level> ?P2044_5 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: In how many movies did Keanu Reeves portray the character John Wick?\nEntities: [{'ID': 'Q43416', 'Label': 'Keanu Reeves', 'Description': 'Canadian actor', 'Probability': 0.9909}, {'ID': 'Q15732802', 'Label': 'John Wick', 'Description': '2014 film directed by Chad Stahelski and David Leitch', 'Probability': 0.4733}, {'ID': 'Q29554576', 'Label': 'John Wick', 'Description': 'American media franchise', 'Probability': 0.2977}, {'ID': 'Q3182744', 'Label': 'John Wick', 'Description': 'role-playing game designer', 'Probability': 0.1374}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_84) AS ?number_of_121) WHERE { ?Q11424_84 wdt:P31 wd:Q11424 . ?Q11424_84 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q106544377 ] . ?Q11424_84 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q43416 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the second movie in the Hunger Games series?\nEntities: [{'ID': 'Q11679', 'Label': 'The Hunger Games', 'Description': 'three books by Suzanne Collins (2008\u20132010)', 'Probability': 0.6716}, {'ID': 'Q212965', 'Label': 'The Hunger Games', 'Description': '2012 film by Gary Ross', 'Probability': 0.2239}, {'ID': 'Q11885031', 'Label': 'The Hunger Games', 'Description': 'dystopian film series', 'Probability': 0.1045}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"2\" ; ps:<P179:part_of_the_series> wd:Q11885031 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many members are in The Strokes?\nEntities: [{'ID': 'Q12202', 'Label': 'stroke', 'Description': 'death of a region of brain cells due to poor blood flow', 'Probability': 0.5052}, {'ID': 'Q1689024', 'Label': 'stroke', 'Description': 'calligraphic strokes needed to write the Chinese characters used in East Asia', 'Probability': 0.2165}, {'ID': 'Q211583', 'Label': 'The Strokes', 'Description': 'American rock band', 'Probability': 0.1392}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_39 WHERE { ?Q5_39 wdt:P31 wd:Q5 . wd:Q211583 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?Q5_39 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the last Fast & Furious movie that Paul Walker starred in?\nEntities: [{'ID': 'Q1576873', 'Label': 'Fast & Furious', 'Description': 'American action film franchise', 'Probability': 0.5337}, {'ID': 'Q380996', 'Label': 'Fast & Furious', 'Description': '2009 film directed by Justin Lin', 'Probability': 0.3988}, {'ID': 'Q213864', 'Label': 'Paul Walker', 'Description': 'American actor (1973-2013)', 'Probability': 0.7847}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?thing_12 ?P577_16 WHERE { ?thing_12 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q1576873 ] . ?thing_12 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q213864 ] . ?thing_12 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_16 ] . } ORDER BY DESC(?P577_16) LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is Kylie Jenner's daughter's name?\nEntities: [{'ID': 'Q1770624', 'Label': 'Kylie Jenner', 'Description': 'American media personality and businesswoman', 'Probability': 0.9853}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P25:mother> [ ps:<P25:mother> wd:Q1770624 ] . ?Q5_1 p:<P21:sex_or_gender> [ ps:<P21:sex_or_gender> wd:Q6581072 ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by Martin Scorsese and starred Daniel Day-Lewis?\nEntities: [{'ID': 'Q41148', 'Label': 'Martin Scorsese', 'Description': 'American film director, screenwriter and producer', 'Probability': 0.9966}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q41148 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q166389 ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many members made up The Black Eyed Peas?\nEntities: [{'ID': 'Q134541', 'Label': 'Black Eyed Peas', 'Description': 'American hip hop group from California', 'Probability': 0.9742}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?P527_8) AS ?number_of_46) WHERE { wd:Q134541 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Harry Potter movie is shortest?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2047_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q216930 ] . ?Q11424_349 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_353 ] . } ORDER BY ASC(?P2047_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is Robert Downey Jr's net worth?\nEntities: [{'ID': 'Q165219', 'Label': 'Robert Downey Jr.', 'Description': 'American actor (born 1965)', 'Probability': 0.9977}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P2218_8WHERE { wd:Q165219 p:<P2218:net_worth> [ ps:<P2218:net_worth> ?P2218_8 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the first book in A Series of Unfortunate Events called?\nEntities: [{'ID': 'Q213841', 'Label': 'A Series of Unfortunate Events', 'Description': 'novel series by Lemony Snicket', 'Probability': 0.5524}, {'ID': 'Q25340369', 'Label': 'A Series of Unfortunate Events', 'Description': 'American black comedy-drama television series from Netflix', 'Probability': 0.4196}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q213841 ; n2<P1545:series_ordinal> \"1\" ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who starred as Aquaman?\nEntities: [{'ID': 'Q623059', 'Label': 'Aquaman', 'Description': 'comic book superhero', 'Probability': 0.7776}, {'ID': 'Q22998395', 'Label': 'Aquaman', 'Description': '2018 film directed by James Wan', 'Probability': 0.1602}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1WHERE { ?Q5_1 wdt:P31 wd:Q5 .wd:Q22998395 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ; n1<P453:character_role> wd:Q56244641 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the first Republican Party female to become a senator?\nEntities: [{'ID': 'Q29468', 'Label': 'Republican Party', 'Description': 'American political party', 'Probability': 0.8888}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?P580_9 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n1:P4100 wd:Q29468 ; ps:<P39:position_held> wd:Q4416090 ; n1<P580:start_time> ?P580_9 ] . ?Q5_1 p:<P21:sex_or_gender> [ ps:<P21:sex_or_gender> wd:Q6581072 ] . } ORDER BY ASC(?P580_9) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Die Hard films are there?\nEntities: [{'ID': 'Q105598', 'Label': 'Die Hard', 'Description': '1988 American action film by John McTiernan', 'Probability': 0.8029}, {'ID': 'Q2716420', 'Label': 'Die Hard', 'Description': 'series of action movies beginning with Die Hard in 1988', 'Probability': 0.1014}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_311) AS ?number_of_348) WHERE { ?Q11424_311 wdt:P31 wd:Q11424 . ?Q11424_311 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q2716420 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many actors have been elected president?\nEntities: [{'ID': 'Q11696', 'Label': 'President of the United States ', 'Description': 'head of state and head of government of the United States of America', 'Probability': 0.44}, {'ID': 'Q33999', 'Label': 'actor', 'Description': 'person who acts in a dramatic or comic production and works in film, television, theatre, or radio', 'Probability': 0.3988}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q5_1) AS ?number_of_297) WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P106:occupation> [ ps:<P106:occupation> wd:Q33999 ] . ?Q47566_260 wdt:P31 wd:Q47566 . ?Q47566_260 p:<P991:successful_candidate> [ ps:<P991:successful_candidate> ?Q5_1 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did The Twilight Saga: New Moon come out before 1995?\nEntities: [{'ID': 'Q116928', 'Label': 'The Twilight Saga: New Moon', 'Description': '2009 film directed by Chris Weitz', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_94 WHERE { wd:Q116928 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_94) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which original member(s) of Queen are not alive anymore?\nEntities: [{'ID': 'Q15862', 'Label': 'Queen', 'Description': 'British rock band', 'Probability': 0.4934}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P527_4 ?P570_12 WHERE { wd:Q15862 p:<P31:instance_of> [ ps:<P31:instance_of> wd:Q5741069 ] . wd:Q15862 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_4 ] . ?P527_4 p:<P570:date_of_death> [ ps:<P570:date_of_death> ?P570_12 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Pulp Fiction come out before 1992?\nEntities: [{'ID': 'Q104123', 'Label': 'Pulp Fiction', 'Description': '1994 film by Quentin Tarantino', 'Probability': 0.6511}, {'ID': 'Q865585', 'Label': 'pulp magazine', 'Description': 'fiction magazines made from 1896 to the 1950s', 'Probability': 0.3325}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_93 WHERE { wd:Q104123 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_93) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Bourne movies has Matt Damon starred in?\nEntities: [{'ID': 'Q2223229', 'Label': 'Bourne', 'Description': 'market town in South Kesteven, Lincolnshire, England', 'Probability': 0.2918}, {'ID': 'Q2282039', 'Label': 'Bourne', 'Description': 'town in Barnstable County, Massachusetts, United States', 'Probability': 0.153}, {'ID': 'Q175535', 'Label': 'Matt Damon', 'Description': 'American actor, screenwriter, and producer', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_8) AS ?number_of_45) WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q868683 ] . ?Q11424_8 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q175535 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actress starred in Harry Potter and went to Brown University?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}, {'ID': 'Q49114', 'Label': 'Brown University', 'Description': 'private university in Providence, Rhode Island, United States', 'Probability': 0.9928}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P69:educated_at> [ ps:<P69:educated_at> wd:Q49114 ] . ?Q5_1 p:<P106:occupation> [ ps:<P106:occupation> wd:Q10800557 ] . wd:Q216930 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which 2000 M. Night Shyamalan movie does not star Michael Jordan?\nEntities: [{'ID': 'Q51489', 'Label': 'M. Night Shyamalan', 'Description': 'American screenwriter, film director and producer', 'Probability': 1.0}, {'ID': 'Q41421', 'Label': 'Michael Jordan', 'Description': 'American basketball player and businessman (born 1963)', 'Probability': 0.9716}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P577_46 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P57:director> [ ps:<P57:director> wd:Q51489 ] . FILTER ( NOT EXISTS { ?Q11424_8 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q41421 ] . } ) ?Q11424_8 p:<P57:director>7 [ ps:<P57:director>7 ?P577_46 ] . FILTER ( (year(?P577_46) = \"2000\"^^xsd:integer) ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actress starred in Freaky Friday and the Parent Trap, and was born in the Bronx?\nEntities: [{'ID': 'Q118713', 'Label': 'Freaky Friday', 'Description': '2003 film directed by Mark Waters', 'Probability': 0.4103}, {'ID': 'Q1305497', 'Label': 'Freaky Friday', 'Description': '1976 film by Gary Nelson', 'Probability': 0.2051}, {'ID': 'Q2558373', 'Label': 'Freaky Friday', 'Description': 'book by Mary Rodgers', 'Probability': 0.1436}, {'ID': 'Q729782', 'Label': 'The Parent Trap', 'Description': '1998 film directed by Nancy Meyers', 'Probability': 0.8333}, {'ID': 'Q1217234', 'Label': 'The Parent Trap', 'Description': '1961 film by David Swift', 'Probability': 0.1667}, {'ID': 'Q18426', 'Label': 'The Bronx', 'Description': 'borough of New York City, United States', 'Probability': 0.9746}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_247 WHERE { ?Q5_247 wdt:P31 wd:Q5 . ?Q5_247 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> wd:Q18426 ] . wd:Q729782 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_247 ] . wd:Q118713 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_247 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the third Fast & Furious movie to be released?\nEntities: [{'ID': 'Q1576873', 'Label': 'Fast & Furious', 'Description': 'American action film franchise', 'Probability': 0.5337}, {'ID': 'Q380996', 'Label': 'Fast & Furious', 'Description': '2009 film directed by Justin Lin', 'Probability': 0.3988}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_9 WHERE { ?Q11424_9 wdt:P31 wd:Q11424 . ?Q11424_9 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"3\" ; ps:<P179:part_of_the_series> wd:Q1576873 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When was the first Matrix movie released?\nEntities: [{'ID': 'Q44337', 'Label': 'matrix', 'Description': 'rectangular array of numbers, symbols, or expressions, arranged in rows and columns', 'Probability': 0.5091}, {'ID': 'Q1463013', 'Label': 'matrix', 'Description': 'geological term for the mass of material in which larger grains, crystals or clasts are embedded', 'Probability': 0.1259}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?expr_197 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P8345:media_franchise> [ ps:<P8345:media_franchise> wd:Q13014087 ] . ?Q11424_8 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_110 ] . BIND (year(?P577_110) AS ?expr_197) } ORDER BY ASC(?P577_110) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Pulitzer Prizes has Colson Whitehead won?\nEntities: [{'ID': 'Q46525', 'Label': 'Pulitzer Prize', 'Description': 'award for achievements in journalism, literature, and musical composition within the United States', 'Probability': 0.9845}, {'ID': 'Q509662', 'Label': 'Colson Whitehead', 'Description': 'American novelist', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P1686_11 WHERE { n1:Q509662 p:<P166:award_received> [ ps:<P166:award_received> ?P361_9 ; n2<P1686:for_work> ?P1686_11 ] . ?P361_9 p:<P361:part_of> [ ps:<P361:part_of> n1:Q46525 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the first African American senator?\nEntities: [{'ID': 'Q2035701', 'Label': 'Race and ethnicity in the United States Census', 'Description': 'data items in which residents choose races they most closely identify with', 'Probability': 0.8038}, {'ID': 'Q49085', 'Label': 'African Americans', 'Description': 'Americans with sub-Saharan African ancestry', 'Probability': 0.194}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?P580_9 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ ps:<P39:position_held> wd:Q4416090 ; n1<P580:start_time> ?P580_9 ] . ?Q5_1 p:<P172:ethnic_group> [ ps:<P172:ethnic_group> wd:Q49085 ] . } ORDER BY ASC(?P580_9) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Parasite come out after 2018?\nEntities: [{'ID': 'Q186517', 'Label': 'parasitism', 'Description': 'relationship between species, where one organism, the parasite, lives on or in another organism, the host, causing it some harm, and is adapted structurally to this way of life', 'Probability': 0.8203}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_5 ?expr_90 WHERE { n1:Q61448040 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_5 ] . BIND (year(?P577_5) AS ?expr_90) }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Inception have a bigger budget than Dunkirk?\nEntities: [{'ID': 'Q25188', 'Label': 'Inception', 'Description': '2010 film directed by Christopher Nolan', 'Probability': 0.9233}, {'ID': 'Q45797', 'Label': 'Dunkirk', 'Description': 'commune in Nord, France', 'Probability': 0.6804}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P2130_16WHERE { wd:Q25188 p:<P2130:cost> [ ps:<P2130:cost> ?P2130_16 ] . }LIMIT 200\n"
        }