{
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Does Delhi have a higher population than Tokyo?\nEntities: [{'ID': 'Q1353', 'Label': 'Delhi', 'Description': 'Indian metropolis and union territory that includes New Delhi', 'Probability': 0.9004}, {'ID': 'Q1490', 'Label': 'Tokyo', 'Description': 'capital and largest city of Japan', 'Probability': 0.9603}]\n\n###\n\n",
            "completion": "ask WHERE { wd:Q1490 p:<P1082:population> [ ps:<P1082:population> ?P1082_8 ] . wd:Q1353 p:<P1082:population> [ps:<P1082:population> ?P1082_7]. Filter (?P1082_8 >?P1082_7) }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actor starred in Good Will Hunting and attended Harvard?\nEntities: [{'ID': 'Q193835', 'Label': 'Good Will Hunting', 'Description': '1997 film by Gus Van Sant', 'Probability': 1.0}, {'ID': 'Q13371', 'Label': 'Harvard University', 'Description': 'private university in Cambridge, Massachusetts', 'Probability': 0.8102}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P69:educated_at> [ ps:<P69:educated_at> wd:Q13371 ] . wd:Q193835 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the shortest movie to win an Oscar?\nEntities: [{'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.6452}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q24862_1 ?P2047_38 WHERE { ?Q24862_1 wdt:P31 wd:Q24862 . ?Q24862_1 p:<P166:award_received> [ ps:<P166:award_received> wd:Q917808 ] . ?Q24862_1 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_38 ] . } ORDER BY ASC(?P2047_38) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many current members are in N.E.R.D?\nEntities: [{'ID': 'Q650031', 'Label': 'nerd', 'Description': 'descriptive term, often used pejoratively, indicating that a person is overly intellectual, obsessive, or socially impaired, while tending to conduct characteristic activities like computing and science', 'Probability': 0.6025}, {'ID': 'Q941293', 'Label': 'N.E.R.D.', 'Description': 'American rock, funk, and hip hop band', 'Probability': 0.3679}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q5_8) AS ?number_of_45) WHERE { ?Q5_8 wdt:P31 wd:Q5 . wd:Q941293 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?Q5_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which G-Idle members were not born in South Korea?\nEntities: [{'ID': 'Q847181', 'Label': 'Gidle', 'Description': 'village of Poland', 'Probability': 0.8261}, {'ID': 'Q2071698', 'Label': 'Gmina Gidle', 'Description': 'rural gmina of Poland', 'Probability': 0.1739}, {'ID': 'Q884', 'Label': 'South Korea', 'Description': 'country in East Asia', 'Probability': 0.9206}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P463_8 ?P19_111 WHERE { ?P463_8 p:<P463:member_of> [ ps:<P463:member_of> wd:Q51885404 ] . ?P463_8 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> ?P19_111 ] . FILTER ( NOT EXISTS { ?P19_111 p:<P17:country> [ ps:<P17:country> wd:Q884 ] . } ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What children's literacy show was hosted by LeVar Burton?\nEntities: [{'ID': 'Q312570', 'Label': 'LeVar Burton', 'Description': 'American actor, director, and television host (born 1957)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_8 ?P1686_12 WHERE { ?Q5_8 wdt:P31 wd:Q5 . VALUES ?Q5_8 { wd:Q312570 wd:Q3595729 wd:Q6506493 wd:Q7300190 wd:Q109545571 wd:Q8455334 wd:Q7769261 wd:Q670646 wd:Q107043722 wd:Q55295977 wd:Q18510640} FILTER ( ?Q5_8 = wd:Q312570 ) ?Q5_8 p:<P1411:nominated_for> [ n1<P1686:for_work> ?P1686_12 ; ps:<P1411:nominated_for> wd:Q6952068 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the second movie in the Peter Jackson Lord of the Rings trilogy?\nEntities: [{'ID': 'Q4465', 'Label': 'Peter Jackson', 'Description': 'New Zealand film director, screenwriter and producer', 'Probability': 0.7733}, {'ID': 'Q15228', 'Label': 'The Lord of the Rings', 'Description': '1954\u20131955 fantasy novel by J. R. R. Tolkien', 'Probability': 0.5616}, {'ID': 'Q190214', 'Label': 'The Lord of the Rings trilogy', 'Description': '2001-2003 three films directed by Peter Jackson', 'Probability': 0.2414}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"2\" ; ps:<P179:part_of_the_series> wd:Q190214 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by Christopher Nolan and starred Robert Pattinson?\nEntities: [{'ID': 'Q25191', 'Label': 'Christopher Nolan', 'Description': 'British\u2013American filmmaker (born 1970)', 'Probability': 0.988}, {'ID': 'Q36767', 'Label': 'Robert Pattinson', 'Description': 'English actor and model', 'Probability': 0.9636}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q25191 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q36767 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did the song Rehab by Amy Winehouse come out before 2003?\nEntities: [{'ID': 'Q1260022', 'Label': 'drug rehabilitation', 'Description': 'processes of treatment for drug dependency', 'Probability': 0.4958}, {'ID': 'Q257517', 'Label': 'Rehab', 'Description': '2006 single by Amy Winehouse', 'Probability': 0.1429}, {'ID': 'Q15897', 'Label': 'Amy Winehouse', 'Description': 'British singer and songwriter (1983\u20132011)', 'Probability': 0.9964}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P577_8 ?expr_94 WHERE { wd:Q257517 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_94) FILTER ( (?expr_94 < \"2003\"^^xsd:integer) ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which X-Men movies did Patrick Stewart not appear in?\nEntities: [{'ID': 'Q128452', 'Label': 'X-Men', 'Description': 'fictional superhero team in Marvel Comics', 'Probability': 0.625}, {'ID': 'Q17149274', 'Label': 'XMEN Disease', 'Description': 'human disease', 'Probability': 0.25}, {'ID': 'Q18047370', 'Label': 'MAGT1', 'Description': 'protein-coding gene in the species Homo sapiens', 'Probability': 0.125}, {'ID': 'Q16296', 'Label': 'Patrick Stewart', 'Description': 'British actor (born 1940)', 'Probability': 0.9762}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P527_4 WHERE { wd:Q2006869 p:<P31:instance_of> [ ps:<P31:instance_of> wd:Q24856 ] . wd:Q2006869 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_4 ] . FILTER ( NOT EXISTS { ?P527_4 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q16296 ] . } ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 13th president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"13\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many members are in G-Idle?\nEntities: [{'ID': 'Q847181', 'Label': 'Gidle', 'Description': 'village of Poland', 'Probability': 0.8261}, {'ID': 'Q2071698', 'Label': 'Gmina Gidle', 'Description': 'rural gmina of Poland', 'Probability': 0.1739}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?P463_9) AS ?number_of_47) WHERE { ?P463_9 p:<P463:member_of> [ ps:<P463:member_of> wd:Q51885404 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When did M\u00f6tley Cr\u00fce form?\nEntities: [{'ID': 'Q486688', 'Label': 'M\u00f6tley Cr\u00fce', 'Description': 'American rock band', 'Probability': 0.9914}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P571_8 ?expr_93WHERE { wd:Q486688 p:<P571:inception> [ ps:<P571:inception> ?P571_8 ] .wd:Q1808470 p:<P175:performer> [ ps:<P175:performer> wd:Q486688 ] .BIND (year(?P571_8) AS ?expr_93) }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which country won the most medals at the 2016 Olympics?\nEntities: [{'ID': 'Q5389', 'Label': 'Olympic Games', 'Description': 'major international sport event', 'Probability': 0.4943}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P710_8 ?thing_112 ?P1114_215 WHERE { wd:Q8613 p:<P710:participant> [ ps:<P710:participant> ?P710_8 ] . ?P710_8 p:<P166:award_received> [ ps:<P166:award_received> ?thing_112 ; n1<P1114:quantity> ?P1114_215 ] . } ORDER BY DESC(?P1114_215) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Matrix movie did Lilly Wachowski not direct?\nEntities: [{'ID': 'Q44337', 'Label': 'matrix', 'Description': 'rectangular array of numbers, symbols, or expressions, arranged in rows and columns', 'Probability': 0.5091}, {'ID': 'Q1463013', 'Label': 'matrix', 'Description': 'geological term for the mass of material in which larger grains, crystals or clasts are embedded', 'Probability': 0.1259}, {'ID': 'Q195719', 'Label': 'The Wachowskis', 'Description': 'American film directors, screenwriters, and producers', 'Probability': 0.7778}, {'ID': 'Q9544977', 'Label': 'Lilly Wachowski', 'Description': 'Polish-American film director', 'Probability': 0.2222}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . wd:Q1210827 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?Q11424_1 ] . ?Q11424_1 p:<P57:director> [ ps:<P57:director> [] ] . FILTER ( NOT EXISTS { ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q9544977 ] . } ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Godfather movie is the longest?\nEntities: [{'ID': 'Q223973', 'Label': 'godparent', 'Description': \"person who sponsors a child's baptism\", 'Probability': 0.7046}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2047_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q3225260 ] . ?Q11424_349 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_353 ] . } ORDER BY DESC(?P2047_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which members of NSYNC were not born in New York?\nEntities: [{'ID': 'Q154454', 'Label': 'NSYNC', 'Description': 'American boy band', 'Probability': 0.992}, {'ID': 'Q1384', 'Label': 'New York', 'Description': 'state of the United States of America', 'Probability': 0.6371}, {'ID': 'Q60', 'Label': 'New York City', 'Description': 'most populous city in the United States of America', 'Probability': 0.2885}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P527_4 ?P19_42 WHERE { wd:Q154454 p:<P31:instance_of> [ ps:<P31:instance_of> wd:Q216337 ] . wd:Q154454 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_4 ] . ?P527_4 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> ?P19_42 ] . FILTER ( NOT EXISTS { ?P19_42 p:<P373:Commons_category> [ ps:<P373:Commons_category> \"Brooklyn, New York City\" ] . } ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was Harper Lee's last book?\nEntities: [{'ID': 'Q182658', 'Label': 'Harper Lee', 'Description': 'American author', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 ?P577_5 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P50:author> [ ps:<P50:author> wd:Q182658 ] . ?Q7725634_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_5 ] . } ORDER BY DESC(?P577_5) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Die Hard come out after 2000?\nEntities: [{'ID': 'Q105598', 'Label': 'Die Hard', 'Description': '1988 American action film by John McTiernan', 'Probability': 0.8029}, {'ID': 'Q2716420', 'Label': 'Die Hard', 'Description': 'series of action movies beginning with Die Hard in 1988', 'Probability': 0.1014}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P577_8 ?expr_134 WHERE { wd:Q105598 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_134) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the first female senator?\nEntities: [{'ID': 'Q15686806', 'Label': 'senator', 'Description': 'member of a senate, usually the upper house of a legislature', 'Probability': 0.82}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?P580_9 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ ps:<P39:position_held> wd:Q4416090 ; n1<P580:start_time> ?P580_9 ] . ?Q5_1 p:<P21:sex_or_gender> [ ps:<P21:sex_or_gender> wd:Q6581072 ] . } ORDER BY ASC(?P580_9) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Quentin Tarantino movie is the longest?\nEntities: [{'ID': 'Q3772', 'Label': 'Quentin Tarantino', 'Description': 'American film director, screenwriter, producer, and actor', 'Probability': 0.9994}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P2047_38 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q3772 ] . ?Q11424_1 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_38 ] . } ORDER BY DESC(?P2047_38) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Kill Bill movies are there?\nEntities: [{'ID': 'Q165325', 'Label': 'Kill Bill Volume 1', 'Description': '2003 American film by Quentin Tarantino', 'Probability': 0.9502}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_46) AS ?number_of_83) WHERE { ?Q11424_46 wdt:P31 wd:Q11424 . ?Q11424_46 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q223132 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the name of the first Harry Potter movie in the series?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q216930 ; n1<P1545:series_ordinal> \"1\" ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the first movie directed by M. Night Shyamalan?\nEntities: [{'ID': 'Q51489', 'Label': 'M. Night Shyamalan', 'Description': 'American screenwriter, film director and producer', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P577_5 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q51489 ] . ?Q11424_1 p:<P57:director>7 [ ps:<P57:director>7 ?P577_5 ] . } ORDER BY ASC(?P577_5) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: In what year was the first Harry Potter movie released?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P580_8 ?expr_93WHERE { wd:Q216930 p:<P580:start_time> [ ps:<P580:start_time> ?P580_8 ] .BIND (year(?P580_8) AS ?expr_93) }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who played Ellen Ripley in the first four Alien movies?\nEntities: [{'ID': 'Q988925', 'Label': 'Ellen Ripley', 'Description': 'fictional character', 'Probability': 1.0}, {'ID': 'Q103569', 'Label': 'Alien', 'Description': '1979 film by Ridley Scott', 'Probability': 0.3185}, {'ID': 'Q181508', 'Label': 'extraterrestrial life', 'Description': 'life that does not originate from Earth', 'Probability': 0.2876}, {'ID': 'Q1307329', 'Label': 'fictional extraterrestrial', 'Description': 'kind of fictional creature that does not originate on Earth', 'Probability': 0.1058}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P161_12 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q1990792 ] . ?Q11424_8 p:<P161:cast_member> [ ps:<P161:cast_member> ?P161_12 ; n1<P453:character_role> wd:Q988925 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which country has a larger population, Rwanda or Bolivia?\nEntities: [{'ID': 'Q1037', 'Label': 'Rwanda', 'Description': 'sovereign state in Africa', 'Probability': 0.9313}, {'ID': 'Q750', 'Label': 'Bolivia', 'Description': 'sovereign state in South America', 'Probability': 0.9466}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P1082_151WHERE { wd:Q750 p:<P1082:population> [ ps:<P1082:population> ?P1082_151 ; n1<P585:point_in_time> \"2017-01-01T00:00:00Z\"^^xsd:dateTime ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What species is Chewbacca?\nEntities: [{'ID': 'Q51803', 'Label': 'Chewbacca', 'Description': 'fictional character from Star Wars', 'Probability': 0.9897}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q99662445_9 WHERE { ?Q99662445_9 wdt:P31 wd:Q99662445 . wd:Q51803 p:<P31:instance_of> [ ps:<P31:instance_of> ?Q99662445_9 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the latest US state to be admitted to the union that is not Hawaii?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.9022}, {'ID': 'Q214102', 'Label': 'Union', 'Description': \"the United States's national government and the 20 free states and five border slave states during the Civil War\", 'Probability': 0.3258}, {'ID': 'Q1752901', 'Label': 'Union Army', 'Description': 'the land force that fought for the Union during the American Civil War', 'Probability': 0.1493}, {'ID': 'Q178790', 'Label': 'labor union', 'Description': 'organization of workers with common goals', 'Probability': 0.1101}, {'ID': 'Q782', 'Label': 'Hawaii', 'Description': 'state of the United States of America', 'Probability': 0.8661}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q35657_8 ?P571_632 WHERE { ?Q35657_8 wdt:P31 n1:Q35657 . ?Q35657_8 p:<P571:inception> [ ps:<P571:inception> ?P571_632 ] . FILTER ( !( ?Q35657_8 = n1:Q782 ) ) } ORDER BY DESC(?P571_632) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was Julia Robert's first husband?\nEntities: [{'ID': 'Q40523', 'Label': 'Julia Roberts', 'Description': 'American actress (born 1967)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_8 ?P582_12 WHERE { ?Q5_8 wdt:P31 wd:Q5 . ?Q5_8 p:<P26:spouse> [ n1<P582:end_time> ?P582_12 ; ps:<P26:spouse> wd:Q40523 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Twilight come out before 1995?\nEntities: [{'ID': 'Q160071', 'Label': 'Twilight', 'Description': '2008 film directed by Catherine Hardwicke', 'Probability': 0.2113}, {'ID': 'Q164160', 'Label': 'twilight', 'Description': \"illumination of the Earth's lower atmosphere when the Sun itself is not directly visible because it is below the horizon\", 'Probability': 0.1569}, {'ID': 'Q44523', 'Label': 'Twilight', 'Description': 'series of vampire romance novels by Stephenie Meyer', 'Probability': 0.1133}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_94 WHERE { wd:Q160071 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_94) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by Edward James Olmos and starred Edward James Olmos?\nEntities: [{'ID': 'Q211415', 'Label': 'Edward James Olmos', 'Description': 'American actor and director', 'Probability': 1.0}, {'ID': 'Q211415', 'Label': 'Edward James Olmos', 'Description': 'American actor and director', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q211415 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q211415 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by the Wachowski Brothers and had Keanu Reeves in it?\nEntities: [{'ID': 'Q195719', 'Label': 'The Wachowskis', 'Description': 'American film directors, screenwriters, and producers', 'Probability': 1.0}, {'ID': 'Q43416', 'Label': 'Keanu Reeves', 'Description': 'Canadian actor', 'Probability': 0.9909}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q195719 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q43416 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which of the Transformers movies is the longest?\nEntities: [{'ID': 'Q1323565', 'Label': 'Transformers', 'Description': 'Japanese\u2013American media franchise', 'Probability': 0.354}, {'ID': 'Q171453', 'Label': 'Transformers', 'Description': '2007 film directed by Michael Bay', 'Probability': 0.2718}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2047_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q2073466 ] . ?Q11424_349 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_353 ] . } ORDER BY DESC(?P2047_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actress in Blue Lagoon graduated from Princeton University?\nEntities: [{'ID': 'Q886946', 'Label': 'Blue Lagoon', 'Description': 'lake in Iceland', 'Probability': 0.4386}, {'ID': 'Q21578', 'Label': 'Princeton University', 'Description': 'private Ivy League research university in Princeton, New Jersey, United States', 'Probability': 0.994}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P69:educated_at> [ ps:<P69:educated_at> wd:Q21578 ] . wd:Q83767 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Deadpool movies are there?\nEntities: [{'ID': 'Q1631090', 'Label': 'Deadpool', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.7055}, {'ID': 'Q19347291', 'Label': 'Deadpool', 'Description': '2016 film directed by Tim Miller', 'Probability': 0.2687}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_311) AS ?number_of_348) WHERE { ?Q11424_311 wdt:P31 wd:Q11424 . ?Q11424_311 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q29559108 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by George Lucas and came out in 1973?\nEntities: [{'ID': 'Q38222', 'Label': 'George Lucas', 'Description': 'American filmmaker', 'Probability': 0.9817}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P577_38 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q38222 ] . ?Q11424_1 p:<P57:director>7 [ ps:<P57:director>7 ?P577_38 ] . FILTER ( (year(?P577_38) = \"1973\"^^xsd:integer) ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Grammy's did Ella Fitzgerald win?\nEntities: [{'ID': 'Q41254', 'Label': 'Grammy Awards', 'Description': 'American award for achievements in music', 'Probability': 0.9585}, {'ID': 'Q1768', 'Label': 'Ella Fitzgerald', 'Description': 'American jazz singer (1917\u20131996)', 'Probability': 0.9966}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q41254_8) AS ?number_of_111) WHERE { ?Q41254_8 wdt:P31 wd:Q41254 . wd:Q1768 p:<P166:award_received> [ ps:<P166:award_received> ?Q41254_8 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the third Twilight movie?\nEntities: [{'ID': 'Q160071', 'Label': 'Twilight', 'Description': '2008 film directed by Catherine Hardwicke', 'Probability': 0.2113}, {'ID': 'Q164160', 'Label': 'twilight', 'Description': \"illumination of the Earth's lower atmosphere when the Sun itself is not directly visible because it is below the horizon\", 'Probability': 0.1569}, {'ID': 'Q44523', 'Label': 'Twilight', 'Description': 'series of vampire romance novels by Stephenie Meyer', 'Probability': 0.1133}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"3\" ; ps:<P179:part_of_the_series> wd:Q652599 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Terminator movies has Arnold Schwarzenegger been in?\nEntities: [{'ID': 'Q620588', 'Label': 'Terminator', 'Description': 'science fiction media franchise', 'Probability': 0.2809}, {'ID': 'Q1976616', 'Label': 'Terminator', 'Description': 'fictional series of cyborgs portrayed by Arnold Schwarzenegger', 'Probability': 0.1404}, {'ID': 'Q162255', 'Label': 'The Terminator', 'Description': '1984 film by James Cameron', 'Probability': 0.1283}, {'ID': 'Q331824', 'Label': 'terminator', 'Description': 'moving line that separates the illuminated day side and the dark night side of a planetary body', 'Probability': 0.1259}, {'ID': 'Q551327', 'Label': 'Terminator', 'Description': 'autonomous robot, typically humanoid, originally conceived as a virtually indestructible soldier, infiltrator and assassin', 'Probability': 0.1211}, {'ID': 'Q2685', 'Label': 'Arnold Schwarzenegger', 'Description': 'Austrian-American actor, bodybuilder, and politician (born 1947)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_235) AS ?number_of_272) WHERE { ?Q11424_235 wdt:P31 wd:Q11424 . ?Q11424_235 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q98063049 ] . ?Q11424_235 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q2685 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Oscars does Denzel Washington have?\nEntities: [{'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.9239}, {'ID': 'Q42101', 'Label': 'Denzel Washington', 'Description': 'American actor, director and producer (born 1954)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q19020_8) AS ?number_of_47) WHERE { ?Q19020_8 wdt:P31 wd:Q19020 . wd:Q42101 p:<P166:award_received> [ ps:<P166:award_received> ?Q19020_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actor played a Jedi and also starred in Taken?\nEntities: [{'ID': 'Q51724', 'Label': 'Jedi', 'Description': 'religio-political-cultural group in the Star Wars universe', 'Probability': 0.9326}, {'ID': 'Q277080', 'Label': 'Taken', 'Description': '2008 film by Pierre Morel', 'Probability': 0.2857}, {'ID': 'Q1156592', 'Label': 'Taken', 'Description': 'American Sci-Fi, Drama TV series produced by Steven Spielberg (2002)', 'Probability': 0.2647}, {'ID': 'Q24069296', 'Label': 'Taken', 'Description': 'Franco-American drama series based on the Taken film trilogy', 'Probability': 0.1008}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . wd:Q277080 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . ?thing_107 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ; n1<P453:character_role> ?P453_109 ] . ?P453_109 p:<P463:member_of> [ ps:<P463:member_of> wd:Q51724 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the second Thor movie starring Chris Hemsworth?\nEntities: [{'ID': 'Q717588', 'Label': 'Thor', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.3559}, {'ID': 'Q42952', 'Label': 'Thor', 'Description': 'hammer-wielding Nordic god associated with thunder, lightning, storms, oaks, strength, and fertility', 'Probability': 0.3037}, {'ID': 'Q54314', 'Label': 'Chris Hemsworth', 'Description': 'Australian actor (born 1983)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q88306753 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q54314 ] . ?Q11424_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_5 ] . } ORDER BY ASC(?P577_5) LIMIT 1 OFFSET 1\n"
        }