{
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: In how many movies has Laurence Fishburne played the character Morpheus?\nEntities: [{'ID': 'Q193048', 'Label': 'Laurence Fishburne', 'Description': 'American actor', 'Probability': 1.0}, {'ID': 'Q194012', 'Label': 'Morpheus', 'Description': 'Greek deity associated with sleep and dreams', 'Probability': 0.285}, {'ID': 'Q1750842', 'Label': 'Morpheus', 'Description': 'fictional character in The Matrix', 'Probability': 0.2124}, {'ID': 'Q635599', 'Label': 'Morpheus', 'Description': 'peer-to-peer file sharing client', 'Probability': 0.1399}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_159) AS ?number_of_196) WHERE { ?Q11424_159 wdt:P31 wd:Q11424 . ?Q11424_159 p:<P161:cast_member> [ n1<P453:character_role> wd:Q1750842 ; ps:<P161:cast_member> wd:Q193048 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by the Coen brothers and starred Michael Stuhlbarg?\nEntities: [{'ID': 'Q2522178', 'Label': 'Coen', 'Description': 'town in Queensland, Australia', 'Probability': 0.6699}, {'ID': 'Q438445', 'Label': 'Michael Stuhlbarg', 'Description': 'American actor', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q438445 ] . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q13595531 ] . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q13595311 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the third Lord of the Rings movie to be released?\nEntities: [{'ID': 'Q15228', 'Label': 'The Lord of the Rings', 'Description': '1954\u20131955 fantasy novel by J. R. R. Tolkien', 'Probability': 0.5616}, {'ID': 'Q190214', 'Label': 'The Lord of the Rings trilogy', 'Description': '2001-2003 three films directed by Peter Jackson', 'Probability': 0.2414}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q190214 ; n1<P1545:series_ordinal> \"3\" ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the deepest lake in Russia?\nEntities: [{'ID': 'Q159', 'Label': 'Russia', 'Description': 'sovereign state in Eastern Europe and Northern Asia', 'Probability': 0.9214}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q23397_1 ?P4511_103 WHERE { ?Q23397_1 wdt:P31 wd:Q23397 . ?Q23397_1 p:<P17:country> [ ps:<P17:country> wd:Q159 ] . ?Q23397_1 p:<P4511:vertical_depth> [ ps:<P4511:vertical_depth> ?P4511_103 ] . } ORDER BY DESC(?P4511_103) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which island nation is popstar Rihanna from?\nEntities: [{'ID': 'Q36844', 'Label': 'Rihanna', 'Description': 'Barbadian singer', 'Probability': 0.9939}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P27_8 WHERE { wd:Q36844 p:<P27:country_of_citizenship> [ ps:<P27:country_of_citizenship> ?P27_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When was the first movie of the Pirates of the Caribbean franchise released?\nEntities: [{'ID': 'Q384426', 'Label': 'Pirates of the Caribbean', 'Description': 'Disney amusement franchise', 'Probability': 0.3834}, {'ID': 'Q194318', 'Label': 'Pirates of the Caribbean', 'Description': 'Series of fantasy adventure films', 'Probability': 0.3791}, {'ID': 'Q1713564', 'Label': 'Pirates of the Caribbean', 'Description': 'dark ride type at Disney theme parks', 'Probability': 0.1721}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_135 WHERE { wd:Q194318 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_135) } ORDER BY ASC(?P577_8) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the last Marvel movie with Thanos in it?\nEntities: [{'ID': 'Q173496', 'Label': 'Marvel Comics', 'Description': 'company that publishes comic books and related media', 'Probability': 0.6464}, {'ID': 'Q1200552', 'Label': 'Marvel Entertainment', 'Description': 'American entertainment company', 'Probability': 0.1076}, {'ID': 'Q2276627', 'Label': 'Thanos', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.815}, {'ID': 'Q96408036', 'Label': None, 'Description': None, 'Probability': 0.135}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P577_12 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q642878 ] . ?Q11424_8 p:<P674:characters> [ ps:<P674:characters> wd:Q64825451 ] . ?Q11424_8 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_12 ] . } ORDER BY DESC(?P577_12) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did The Thing come out before Halloween?\nEntities: [{'ID': 'Q910204', 'Label': 'Thing', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.4866}, {'ID': 'Q387834', 'Label': 'thing', 'Description': 'type of governing assembly', 'Probability': 0.3812}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_24 ?expr_196WHERE { wd:Q221103 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_24 ] .BIND (year(?P577_24) AS ?expr_196) }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the name of the first Rambo movie?\nEntities: [{'ID': 'Q1621266', 'Label': 'Rambo', 'Description': 'film series', 'Probability': 0.2984}, {'ID': 'Q951317', 'Label': 'John Rambo', 'Description': 'fictional character in the Rambo franchise', 'Probability': 0.2124}, {'ID': 'Q159870', 'Label': 'Rambo', 'Description': '2008 film directed by Sylvester Stallone', 'Probability': 0.1156}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"1\" ; ps:<P179:part_of_the_series> wd:Q1621266 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which 2003 movie directed by Catherine Hardwicke does not star Tom Selleck?\nEntities: [{'ID': 'Q229598', 'Label': 'Catherine Hardwicke', 'Description': 'American film director, screenwriter and architect', 'Probability': 1.0}, {'ID': 'Q213706', 'Label': 'Tom Selleck', 'Description': 'American actor', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P577_45 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P57:director> [ ps:<P57:director> wd:Q229598 ] . FILTER ( NOT EXISTS { ?Q11424_8 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q213706 ] . } ) ?Q11424_8 p:<P57:director>7 [ ps:<P57:director>7 ?P577_45 ] . FILTER ( (year(?P577_45) = \"2003\"^^xsd:integer) ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the name of the eighth Fast & Furious movie?\nEntities: [{'ID': 'Q1576873', 'Label': 'Fast & Furious', 'Description': 'American action film franchise', 'Probability': 0.5337}, {'ID': 'Q380996', 'Label': 'Fast & Furious', 'Description': '2009 film directed by Justin Lin', 'Probability': 0.3988}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"8\" ; ps:<P179:part_of_the_series> wd:Q1576873 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actress was in Suicide Squad and went to Somerset College?\nEntities: [{'ID': 'Q616136', 'Label': 'Suicide Squad', 'Description': 'DC Comics antihero team', 'Probability': 0.5101}, {'ID': 'Q18604504', 'Label': 'Suicide Squad', 'Description': '2016 film directed by David Ayer', 'Probability': 0.3812}, {'ID': 'Q7559837', 'Label': 'Somerset College', 'Description': 'independent, day, co-educational school in Mudgeeraba, Gold Coast, Queensland, Australia', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . wd:Q18604504 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . ?Q5_1 p:<P69:educated_at> [ ps:<P69:educated_at> wd:Q7559837 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Was Parasite released after 2015?\nEntities: [{'ID': 'Q186517', 'Label': 'parasitism', 'Description': 'relationship between species, where one organism, the parasite, lives on or in another organism, the host, causing it some harm, and is adapted structurally to this way of life', 'Probability': 0.8203}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_93 WHERE { wd:Q61448040 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_93) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Is Joe Biden older than Bernie Sanders?\nEntities: [{'ID': 'Q6279', 'Label': 'Joe Biden', 'Description': 'President of the United States since 2021', 'Probability': 0.9959}, {'ID': 'Q359442', 'Label': 'Bernie Sanders', 'Description': 'American politician and activist (born 1941)', 'Probability': 0.9899}]\n\n###\n\n",
            "completion": "ASK WHERE { wd:Q359442 p:<P569:date_of_birth> [ ps:<P569:date_of_birth> ?P569_7 ] . wd:Q6279 p:<P569:date_of_birth> [ ps:<P569:date_of_birth> ?P569_8 ] . BIND(year(xsd:dateTime(?P569_8)) as ?year) BIND(year(xsd:dateTime(?P569_7)) as ?year1) FILTER(?year > ?year1) }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who is the singer for AC/DC, who was born in the United Kingdom?\nEntities: [{'ID': 'Q27593', 'Label': 'AC/DC', 'Description': 'Australian hard rock band', 'Probability': 0.9909}, {'ID': 'Q145', 'Label': 'United Kingdom', 'Description': 'country in north-west Europe', 'Probability': 0.9562}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q5_24 ?P19_30 WHERE { ?Q5_24 wdt:P31 wd:Q5 . ?Q5_24 p:<P106:occupation> [ ps:<P106:occupation> wd:Q177220 ] . ?Q5_24 p:<P463:member_of> [ ps:<P463:member_of> wd:Q27593 ] . ?Q5_24 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> ?P19_30 ] . ?P19_30 p:<P17:country> [ ps:<P17:country> wd:Q145 ] . } ORDER BY DESC(?Q5_24) LIMIT 1 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What year did the Baftas start?\nEntities: [{'ID': 'Q732997', 'Label': 'British Academy Film Awards', 'Description': 'annual award show hosted by the British Academy of Film and Television Arts', 'Probability': 0.4496}, {'ID': 'Q159661', 'Label': 'British Academy of Film and Television Arts', 'Description': 'independent charity', 'Probability': 0.2713}, {'ID': 'Q1369077', 'Label': 'British Academy Television Awards', 'Description': 'British television awards', 'Probability': 0.1008}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P580_8 ?expr_94 WHERE { wd:Q732997 p:<P580:start_time> [ ps:<P580:start_time> ?P580_8 ] . BIND (year(?P580_8) AS ?expr_94) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many members are in Aespa?\nEntities: [{'ID': 'Q100877982', 'Label': 'Aespa', 'Description': 'South Korean girl group', 'Probability': 0.7917}, {'ID': 'Q2010706', 'Label': 'Aespa', 'Description': 'township in Kohila Rural Municipality, Rapla County, Estonia', 'Probability': 0.2083}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?P527_8) AS ?number_of_46) WHERE { wd:Q100877982 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who directed Tom's Cruise's third Mission: Impossible?\nEntities: [{'ID': 'Q37079', 'Label': 'Tom Cruise', 'Description': 'American actor and producer (born 1962)', 'Probability': 0.9951}, {'ID': 'Q1741232', 'Label': 'Mission: Impossible', 'Description': '1996 film directed by Brian De Palma', 'Probability': 0.4}, {'ID': 'Q12006', 'Label': 'Dave Grohl', 'Description': 'American rock musician', 'Probability': 0.2}, {'ID': 'Q87816991', 'Label': 'Mission: Impossible', 'Description': 'multimedia franchise', 'Probability': 0.16}, {'ID': 'Q1057805', 'Label': 'James Taylor Quartet', 'Description': 'band that plays jazz', 'Probability': 0.12}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_9 ?Q11424_14 WHERE { ?Q5_9 wdt:P31 wd:Q5 . ?Q5_9 p:<P106:occupation> [ ps:<P106:occupation> wd:Q2526255 ] . ?Q11424_14 wdt:P31 wd:Q11424 . ?Q11424_14 p:<P57:director> [ ps:<P57:director> ?Q5_9 ] . ?Q11424_14 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q37079 ] . FILTER ( ?Q11424_14 = wd:Q288173 ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many members are in Itzy?\nEntities: [{'ID': 'Q60732823', 'Label': 'Black mamba', 'Description': 'South Korean girl group', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P2124_9 WHERE { wd:Q60732823 p:<P2124:membership> [ ps:<P2124:membership> ?P2124_9 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who is a member of both A Perfect Circle and the Smashing Pumpkins?\nEntities: [{'ID': 'Q300519', 'Label': 'A Perfect Circle', 'Description': 'American alternative rock band', 'Probability': 1.0}, {'ID': 'Q184217', 'Label': 'The Smashing Pumpkins', 'Description': 'American alternative rock band', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . wd:Q300519 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?Q5_1 ] . wd:Q184217 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?Q5_1 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actress was in Gone with the Wind and in A Streetcar Named Desire?\nEntities: [{'ID': 'Q2875', 'Label': 'Gone with the Wind', 'Description': '1939 film by Victor Fleming', 'Probability': 0.7095}, {'ID': 'Q2870', 'Label': 'Gone with the Wind', 'Description': '1936 novel by Margaret Mitchell', 'Probability': 0.2302}, {'ID': 'Q842106', 'Label': 'A Streetcar Named Desire', 'Description': '1947 play by Tennessee Williams', 'Probability': 0.7523}, {'ID': 'Q212129', 'Label': 'A Streetcar Named Desire', 'Description': '1951 film directed by Elia Kazan', 'Probability': 0.1546}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . wd:Q2875 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . wd:Q212129 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . ?Q5_1 p:<P21:sex_or_gender> [ ps:<P21:sex_or_gender> wd:Q6581072 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many books are in the Harry Potter franchise?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?P527_8) AS ?number_of_47) WHERE { ?P527_8 wdt:P31 wd:Q7725634 . wd:Q8337 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Matrix movies are there?\nEntities: [{'ID': 'Q44337', 'Label': 'matrix', 'Description': 'rectangular array of numbers, symbols, or expressions, arranged in rows and columns', 'Probability': 0.5091}, {'ID': 'Q1463013', 'Label': 'matrix', 'Description': 'geological term for the mass of material in which larger grains, crystals or clasts are embedded', 'Probability': 0.1259}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_8) AS ?number_of_45) WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q1210827 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie had a bigger budget, The Wizard of Oz or Gone With The Wind?\nEntities: [{'ID': 'Q2382687', 'Label': 'Wizard of Oz', 'Description': 'character from The Wonderful Wizard of Oz', 'Probability': 0.3214}, {'ID': 'Q193695', 'Label': 'The Wizard of Oz', 'Description': '1939 movie based on the book by L. Frank Baum', 'Probability': 0.2991}, {'ID': 'Q130295', 'Label': 'The Wonderful Wizard of Oz', 'Description': \"1900 children's novel by L. Frank Baum\", 'Probability': 0.1964}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P2130_8WHERE { wd:Q193695 p:<P2130:cost> [ ps:<P2130:cost> ?P2130_8 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the fifth book in the Wheel of Time series?\nEntities: [{'ID': 'Q4470', 'Label': 'The Wheel of Time', 'Description': 'series of fantasy novels by Robert Jordan', 'Probability': 0.4921}, {'ID': 'Q7992037', 'Label': 'Wheel of time', 'Description': 'religious and philosophical concept of cyclical, repeating epochs or ages', 'Probability': 0.2063}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ n2<P1545:series_ordinal> \"5\" ; ps:<P179:part_of_the_series> wd:Q4470 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which member of The Firm also starred in Belly?\nEntities: [{'ID': 'Q783794', 'Label': 'company', 'Description': 'legal entity representing an association of people, whether natural, legal or a mixture of both, with a specific objective', 'Probability': 0.3595}, {'ID': 'Q613142', 'Label': 'law firm', 'Description': 'business entity formed by one or more lawyers to engage in the practice of law', 'Probability': 0.1281}, {'ID': 'Q4830453', 'Label': 'business', 'Description': 'organization undertaking commercial, industrial, or professional activity', 'Probability': 0.1116}, {'ID': 'Q3778211', 'Label': 'legal person', 'Description': 'any human or non-human entity that is recognized as having privileges and obligations; a legal fiction which is used to abstract away the differences between natural persons, juridical persons and other entities such as countries', 'Probability': 0.1074}, {'ID': 'Q937045', 'Label': 'Belly', 'Description': 'Canadian rapper, singer, songwriter, and record producer', 'Probability': 0.2976}, {'ID': 'Q816079', 'Label': 'Belly', 'Description': 'American musical group', 'Probability': 0.2143}, {'ID': 'Q646077', 'Label': 'Belly', 'Description': '1998 film directed by Hype Williams', 'Probability': 0.1746}, {'ID': 'Q9597', 'Label': 'abdomen', 'Description': 'frontal part of the body between the thorax (chest) and pelvis', 'Probability': 0.131}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P527_103 WHERE { wd:Q2765475 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_103 ] . wd:Q646077 p:<P161:cast_member> [ ps:<P161:cast_member> ?P527_103 ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When did Martin Scorsese win his first Oscar?\nEntities: [{'ID': 'Q41148', 'Label': 'Martin Scorsese', 'Description': 'American film director, screenwriter and producer', 'Probability': 0.9966}, {'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.6452}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P585_4 ?P1686_90 WHERE { wd:Q41148 p:<P166:award_received> [ pq:<P585:point_in_time> ?P585_4 ; ps:<P166:award_received> wd:Q103360 ] . } LIMIT 20\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many feature movies grossed more than $1.4 billion in 2019?\nEntities: [{'ID': 'Q11424', 'Label': 'film', 'Description': 'sequence of images that give the impression of movement, stored on film stock', 'Probability': 0.865}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_91 ?P577_128 ?P2142_262 ?expr_254 WHERE { ?Q11424_91 wdt:P31 wd:Q11424 . ?Q11424_91 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_128 ] . ?Q11424_91 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_262 ] . FILTER ( xsd:double(str(?P2142_262)) >= 1400000000 ) BIND (year(?P577_128) AS ?expr_254) FILTER ( ?expr_254 = \"2019\"^^xsd:integer ) }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many total Star Wars movies are there?\nEntities: [{'ID': 'Q462', 'Label': 'Star Wars', 'Description': 'epic space opera multimedia franchise created by George Lucas', 'Probability': 0.7404}, {'ID': 'Q17738', 'Label': 'Star Wars: Episode IV \u2013 A New Hope', 'Description': '1977 American epic space opera film directed by George Lucas', 'Probability': 0.1947}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?P527_9) AS ?number_of_113)WHERE { wd:Q22092344 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_9 ] .wd:Q22092344 p:<P361:part_of> [ ps:<P361:part_of> wd:Q462 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which member of The Police was not British?\nEntities: [{'ID': 'Q35535', 'Label': 'police', 'Description': 'constituted body of persons empowered by the state to enforce the law', 'Probability': 0.5336}, {'ID': 'Q145', 'Label': 'United Kingdom', 'Description': 'country in north-west Europe', 'Probability': 0.6037}, {'ID': 'Q842438', 'Label': 'British people', 'Description': 'citizens or residents of the United Kingdom of Great Britain and Northern Ireland, British Overseas Territories, Crown Dependencies, and their descendants', 'Probability': 0.1145}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P463_8 WHERE { ?P463_8 p:<P463:member_of> [ ps:<P463:member_of> wd:Q178095 ] . FILTER ( NOT EXISTS { ?P463_8 p:<P27:country_of_citizenship> [ ps:<P27:country_of_citizenship> wd:Q145 ] . } ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Harry Potter books did not have the character Sirius Black in them?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}, {'ID': 'Q713701', 'Label': 'Sirius Black', 'Description': \"fictional character in J. K. Rowling's Harry Potter novels\", 'Probability': 1.0}]\n\n###\n\n",
            "completion": "WHERE { ?Q7725634_8 wdt:P31 wd:Q7725634 . ?Q7725634_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q8337 ] . FILTER ( NOT EXISTS { ?Q7725634_8 p:<P674:characters> [ ps:<P674:characters> wd:Q713701 ] . } ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Firework by Katy Perry come out after 2012?\nEntities: [{'ID': 'Q127933', 'Label': 'firework', 'Description': 'low explosive pyrotechnic devices used for aesthetic and entertainment purposes', 'Probability': 0.604}, {'ID': 'Q163412', 'Label': 'Firework', 'Description': '2010 single by Katy Perry', 'Probability': 0.3861}, {'ID': 'Q42493', 'Label': 'Katy Perry', 'Description': 'American singer, songwriter, actress and television personality (1984)', 'Probability': 0.9988}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P577_9 WHERE { wd:Q163412 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_9 ] . FILTER ( (year(?P577_9) > \"2012\"^^xsd:integer) ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Harry Potter movie made the most money worldwide?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P2142_5 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q216930 ] . ?Q11424_1 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_5 ] . } ORDER BY DESC(?P2142_5) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actor was the star of Titanic and was born in Los Angeles, California?\nEntities: [{'ID': 'Q44578', 'Label': 'Titanic', 'Description': '1997 film by James Cameron', 'Probability': 0.4532}, {'ID': 'Q25173', 'Label': 'Titanic', 'Description': 'British transatlantic passenger liner, launched and foundered in 1912', 'Probability': 0.3498}, {'ID': 'Q65', 'Label': 'Los Angeles', 'Description': 'largest city in California, United States of America', 'Probability': 0.9623}, {'ID': 'Q99', 'Label': 'California', 'Description': 'state of the United States of America', 'Probability': 0.9588}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 n1:Q5 . n1:Q44578 wdt:P161 ?Q5_1 . ?Q5_1 wdt:P19 n1:Q65 . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Dumb and Dumber movie did Jim Carrey not star in?\nEntities: [{'ID': 'Q462418', 'Label': 'Dumb and Dumber', 'Description': '1994 comedy film by Peter Farrelly', 'Probability': 0.9154}, {'ID': 'Q40504', 'Label': 'Jim Carrey', 'Description': 'Canadian actor', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . wd:Q19007214 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?Q11424_1 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> [] ] . FILTER ( NOT EXISTS { ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q40504 ] . } ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the longest Lord of the Rings book?\nEntities: [{'ID': 'Q15228', 'Label': 'The Lord of the Rings', 'Description': '1954\u20131955 fantasy novel by J. R. R. Tolkien', 'Probability': 0.5616}, {'ID': 'Q190214', 'Label': 'The Lord of the Rings trilogy', 'Description': '2001-2003 three films directed by Peter Jackson', 'Probability': 0.2414}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 ?P1104_39 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q15228 ] . ?Q7725634_1 p:<P1104:number_of_pages> [ ps:<P1104:number_of_pages> ?P1104_39 ] . } LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which EXO members were not born in South Korea?\nEntities: [{'ID': 'Q494717', 'Label': 'EXO', 'Description': 'South Korean musical group; boy band', 'Probability': 0.7143}, {'ID': 'Q392496', 'Label': 'Exo', 'Description': 'public transportation organization in the Montreal metropolitan region, Quebec, Canada', 'Probability': 0.2347}, {'ID': 'Q884', 'Label': 'South Korea', 'Description': 'country in East Asia', 'Probability': 0.9206}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P463_8 ?P19_111 WHERE { ?P463_8 p:<P463:member_of> [ ps:<P463:member_of> wd:Q494717 ] . ?P463_8 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> ?P19_111 ] . FILTER ( NOT EXISTS { ?P19_111 p:<P17:country> [ ps:<P17:country> wd:Q884 ] . } ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many James Bond movies are there with Daniel Craig?\nEntities: [{'ID': 'Q844', 'Label': 'James Bond', 'Description': 'series of books about a British spy', 'Probability': 0.8176}, {'ID': 'Q4547', 'Label': 'Daniel Craig', 'Description': 'English actor', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_84) AS ?number_of_121) WHERE { ?Q11424_84 wdt:P31 wd:Q11424 . ?Q11424_84 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q2484680 ] . ?Q11424_84 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q4547 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 25th US president?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.9022}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"25\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Where was Christian Gray born?\nEntities: [{'ID': 'Q557867', 'Label': 'Fifty Shades of Grey', 'Description': '2011 erotic romance novel', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P19_8WHERE { wd:Q95125355 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> ?P19_8 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the seventh tallest mountain in North America?\nEntities: [{'ID': 'Q49', 'Label': 'North America', 'Description': \"continent on the Earth's northwestern quadrant, spanning from the Arctic Archipelago to the Panama Isthmus\", 'Probability': 0.9897}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q8502_1 ?P2044_5 WHERE { ?Q8502_1 wdt:P31 n1:Q8502 . ?Q8502_1 wdt:P30 n1:Q49 . ?Q8502_1 wdt:P2044 ?P2044_5 . } ORDER BY DESC(?P2044_5) OFFSET 6 LIMIT 1\n"
        }