{
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was Bradley Cooper married to?\nEntities: [{'ID': 'Q205707', 'Label': 'Bradley Cooper', 'Description': 'American actor', 'Probability': 0.9866}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_8 WHERE { ?Q5_8 wdt:P31 wd:Q5 . wd:Q205707 p:<P26:spouse> [ ps:<P26:spouse> ?Q5_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 23th president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"23\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 28th president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"28\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did The Devil's Rejects come out after 2003?\nEntities: [{'ID': 'Q1534510', 'Label': \"The Devil's Rejects\", 'Description': '2005 film by Rob Zombie', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_93 WHERE { wd:Q1534510 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_93) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Is Emma Watson taller than Rupert Grint?\nEntities: [{'ID': 'Q39476', 'Label': 'Emma Watson', 'Description': 'English actress and activist (born 1990)', 'Probability': 1.0}, {'ID': 'Q19190', 'Label': 'Rupert Grint', 'Description': 'English actor', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P2048_16WHERE { wd:Q19190 p:<P2048:height> [ ps:<P2048:height> ?P2048_16 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which president was Donald Trump?\nEntities: [{'ID': 'Q22686', 'Label': 'Donald Trump', 'Description': 'president of the United States from 2017 to 2021', 'Probability': 0.9942}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P1545_4 WHERE { wd:Q22686 p:<P39:position_held> [ n1<P1545:series_ordinal> ?P1545_4 ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many screenwriters does the movie Pulp Fiction have?\nEntities: [{'ID': 'Q104123', 'Label': 'Pulp Fiction', 'Description': '1994 film by Quentin Tarantino', 'Probability': 0.6511}, {'ID': 'Q865585', 'Label': 'pulp magazine', 'Description': 'fiction magazines made from 1896 to the 1950s', 'Probability': 0.3325}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P58_11 WHERE { wd:Q104123 p:<P58:screenwriter> [ ps:<P58:screenwriter> ?P58_11 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the name of the sixth movie in the Harry Potter franchise?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"6\" ; ps:<P179:part_of_the_series> wd:Q216930 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Scary Movie movies did Anna Faris appear in?\nEntities: [{'ID': 'Q219424', 'Label': 'Scary Movie', 'Description': '2000 film by Keenen Ivory Wayans', 'Probability': 0.813}, {'ID': 'Q82269', 'Label': 'Scary Movie pentalogy', 'Description': '2000-2013 film series', 'Probability': 0.122}, {'ID': 'Q4491', 'Label': 'Anna Faris', 'Description': 'American actress', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_46) AS ?number_of_83) WHERE { ?Q11424_46 wdt:P31 wd:Q11424 . ?Q11424_46 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q82269 ] . ?Q11424_46 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q4491 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the longest Harry Potter movie?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2047_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q216930 ] . ?Q11424_349 p:<P2047:duration> [ ps:<P2047:duration> ?P2047_353 ] . } ORDER BY DESC(?P2047_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many books are in the Game of Thrones series?\nEntities: [{'ID': 'Q23572', 'Label': 'Game of Thrones', 'Description': 'American fantasy drama television series', 'Probability': 0.9644}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q7725634_4) AS ?number_of_108) WHERE { ?P179_116 p:<P4969:derivative_work> [ ps:<P4969:derivative_work> wd:Q23572 ] . ?Q7725634_4 wdt:P31 wd:Q7725634 . ?Q7725634_4 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> ?P179_116 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie did John Williams last compose for?\nEntities: [{'ID': 'Q131285', 'Label': 'John Williams', 'Description': 'American composer, conductor, pianist and trombonist (born 1932)', 'Probability': 0.5159}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q11424_113 ?P577_150 WHERE { ?Q11424_113 wdt:P31 wd:Q11424 . ?Q11424_113 p:<P86:composer> [ ps:<P86:composer> wd:Q131285 ] . ?Q11424_113 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_150 ] . } ORDER BY DESC(?P577_150) LIMIT 1}}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many movies have George Clooney and Julia Roberts starred in together?\nEntities: [{'ID': 'Q23844', 'Label': 'George Clooney', 'Description': 'American actor, filmmaker, and activist', 'Probability': 1.0}, {'ID': 'Q40523', 'Label': 'Julia Roberts', 'Description': 'American actress (born 1967)', 'Probability': 0.9862}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_1) AS ?number_of_38) WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q40523 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q23844 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Kung Fu Panda movies are there?\nEntities: [{'ID': 'Q2081372', 'Label': 'Kung Fu Panda', 'Description': 'franchise', 'Probability': 0.6805}, {'ID': 'Q129193', 'Label': 'Kung Fu Panda', 'Description': '2008 film by John Stevenson and Mark Osborne', 'Probability': 0.249}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_122) AS ?number_of_158) WHERE { ?Q11424_122 wdt:P31 wd:Q11424 . ?Q11424_122 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q2081372 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the third Fast & Furious movie chronologically?\nEntities: [{'ID': 'Q1576873', 'Label': 'Fast & Furious', 'Description': 'American action film franchise', 'Probability': 0.5337}, {'ID': 'Q380996', 'Label': 'Fast & Furious', 'Description': '2009 film directed by Justin Lin', 'Probability': 0.3988}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"3\" ; ps:<P179:part_of_the_series> wd:Q1576873 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the first Twilight movie?\nEntities: [{'ID': 'Q160071', 'Label': 'Twilight', 'Description': '2008 film directed by Catherine Hardwicke', 'Probability': 0.2113}, {'ID': 'Q164160', 'Label': 'twilight', 'Description': \"illumination of the Earth's lower atmosphere when the Sun itself is not directly visible because it is below the horizon\", 'Probability': 0.1569}, {'ID': 'Q44523', 'Label': 'Twilight', 'Description': 'series of vampire romance novels by Stephenie Meyer', 'Probability': 0.1133}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"1\" ; ps:<P179:part_of_the_series> wd:Q652599 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who directed the movie Spider-Man 2?\nEntities: [{'ID': 'Q190145', 'Label': 'Spider-Man 2', 'Description': '2004 film directed by Sam Raimi', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P57_8 WHERE { wd:Q190145 p:<P57:director> [ ps:<P57:director> ?P57_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many universities are located in Oxford?\nEntities: [{'ID': 'Q34217', 'Label': 'Oxford', 'Description': 'city in Oxfordshire, England', 'Probability': 0.5686}, {'ID': 'Q34433', 'Label': 'University of Oxford', 'Description': 'collegiate research university in Oxford, England', 'Probability': 0.2781}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q875538_8) AS ?number_of_110) WHERE { ?Q875538_8 wdt:P31 wd:Q875538 . ?Q875538_8 p:<P131:located_in_the_administrative_territorial_entity> [ ps:<P131:located_in_the_administrative_territorial_entity> wd:Q34217 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who is a member of both Tool and A Perfect Circle?\nEntities: [{'ID': 'Q184827', 'Label': 'Tool', 'Description': 'American rock band', 'Probability': 0.6244}, {'ID': 'Q39546', 'Label': 'tool', 'Description': 'physical item that can be used to achieve a goal', 'Probability': 0.3306}, {'ID': 'Q300519', 'Label': 'A Perfect Circle', 'Description': 'American alternative rock band', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q5_8 WHERE { ?Q5_8 wdt:P31 wd:Q5 . ?Q5_8 p:<P463:member_of> [ ps:<P463:member_of> wd:Q300519 ] . ?Q5_8 p:<P463:member_of> [ ps:<P463:member_of> wd:Q184827 ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Marvel movies are there?\nEntities: [{'ID': 'Q173496', 'Label': 'Marvel Comics', 'Description': 'company that publishes comic books and related media', 'Probability': 0.6464}, {'ID': 'Q1200552', 'Label': 'Marvel Entertainment', 'Description': 'American entertainment company', 'Probability': 0.1076}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_1) AS ?number_of_38) WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q642878 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Avengers movie made the most money?\nEntities: [{'ID': 'Q322646', 'Label': 'Avengers', 'Description': 'comic book superhero team', 'Probability': 0.8506}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_349 ?P2142_353 WHERE { ?Q11424_349 wdt:P31 wd:Q11424 . ?Q11424_349 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q20021634 ] . ?Q11424_349 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_353 ] . } ORDER BY DESC(?P2142_353) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Michael Jackson song came out after his death?\nEntities: [{'ID': 'Q2831', 'Label': 'Michael Jackson', 'Description': 'American singer, songwriter, and dancer (1958\u20132009)', 'Probability': 0.9477}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P570_24 ?P577_15 WHERE { wd:Q2831 p:<P570:date_of_death> [ ps:<P570:date_of_death> ?P570_24 ] . wd:Q1621982 p:<P86:composer> [ ps:<P86:composer> wd:Q2831 ] . wd:Q1621982 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_15 ] . FILTER ( (?P577_15 > ?P570_24) ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actor starred in Fight Club and also is a environmental lawyer?\nEntities: [{'ID': 'Q190050', 'Label': 'Fight Club', 'Description': '1999 film by David Fincher', 'Probability': 0.7423}, {'ID': 'Q837283', 'Label': 'Fight Club', 'Description': '1996 novel by Chuck Palahniuk', 'Probability': 0.1595}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . wd:Q190050 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . ?Q5_1 p:<P106:occupation> [ ps:<P106:occupation> wd:Q3578589 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the seventh book in The Wheel of Time series?\nEntities: [{'ID': 'Q4470', 'Label': 'The Wheel of Time', 'Description': 'series of fantasy novels by Robert Jordan', 'Probability': 0.4921}, {'ID': 'Q7992037', 'Label': 'Wheel of time', 'Description': 'religious and philosophical concept of cyclical, repeating epochs or ages', 'Probability': 0.2063}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ n2<P1545:series_ordinal> \"7\" ; ps:<P179:part_of_the_series> wd:Q4470 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When did the Notebook come out?\nEntities: [{'ID': 'Q43013', 'Label': 'notebook', 'Description': 'book for writing, drawing, scrapbooking', 'Probability': 0.4382}, {'ID': 'Q3962', 'Label': 'laptop', 'Description': 'foldable portable personal computer for mobile use', 'Probability': 0.2135}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?expr_180 WHERE { wd:Q223374 p:<P136:genre> [ ps:<P136:genre> wd:Q1054574 ] . wd:Q223374 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_180) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Avatar come out before the year 2000?\nEntities: [{'ID': 'Q83090', 'Label': 'avatar', 'Description': 'material appearance or incarnation of a deity on earth in Hinduism', 'Probability': 0.3927}, {'ID': 'Q24871', 'Label': 'Avatar', 'Description': '2009 film by James Cameron', 'Probability': 0.3202}, {'ID': 'Q152402', 'Label': 'avatar', 'Description': \"graphical representation of the user or the user's alter ego or character\", 'Probability': 0.1582}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_94 WHERE { wd:Q24871 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_94) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Herman Melville novel features a character called Ahab?\nEntities: [{'ID': 'Q4985', 'Label': 'Herman Melville', 'Description': 'American writer and poet (1819\u20131891)', 'Probability': 0.9929}, {'ID': 'Q235901', 'Label': 'Ahab', 'Description': 'King of Israel, the son and successor of Omri, and the husband of Jezebel; portrayed in the Hebrew Bible as a wicked person', 'Probability': 0.7935}, {'ID': 'Q329220', 'Label': 'Ahab', 'Description': 'German musical group; funeral doom metal band', 'Probability': 0.1087}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P50:author> [ ps:<P50:author> wd:Q4985 ] . ?Q7725634_1 p:<P674:characters> [ ps:<P674:characters> wd:Q2630009 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many members in Blackpink?\nEntities: [{'ID': 'Q25056945', 'Label': 'Blackpink', 'Description': 'South Korean girl group', 'Probability': 0.9755}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_39 WHERE { ?Q5_39 wdt:P31 wd:Q5 . wd:Q100877982 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?Q5_39 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actress acted in Star Wars and was born in Israel?\nEntities: [{'ID': 'Q462', 'Label': 'Star Wars', 'Description': 'epic space opera multimedia franchise created by George Lucas', 'Probability': 0.7404}, {'ID': 'Q17738', 'Label': 'Star Wars: Episode IV \u2013 A New Hope', 'Description': '1977 American epic space opera film directed by George Lucas', 'Probability': 0.1947}, {'ID': 'Q801', 'Label': 'Israel', 'Description': 'country in Western Asia', 'Probability': 0.9234}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?Q11424_38 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q11424_38 wdt:P31 wd:Q11424 . ?Q11424_38 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . ?Q11424_38 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q22092344 ] . ?Q5_1 p:<P27:country_of_citizenship> [ ps:<P27:country_of_citizenship> wd:Q801 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who is the star of the Terminator franchise?\nEntities: [{'ID': 'Q620588', 'Label': 'Terminator', 'Description': 'science fiction media franchise', 'Probability': 0.2809}, {'ID': 'Q1976616', 'Label': 'Terminator', 'Description': 'fictional series of cyborgs portrayed by Arnold Schwarzenegger', 'Probability': 0.1404}, {'ID': 'Q162255', 'Label': 'The Terminator', 'Description': '1984 film by James Cameron', 'Probability': 0.1283}, {'ID': 'Q331824', 'Label': 'terminator', 'Description': 'moving line that separates the illuminated day side and the dark night side of a planetary body', 'Probability': 0.1259}, {'ID': 'Q551327', 'Label': 'Terminator', 'Description': 'autonomous robot, typically humanoid, originally conceived as a virtually indestructible soldier, infiltrator and assassin', 'Probability': 0.1211}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1WHERE { ?Q5_1 wdt:P31 wd:Q5 .wd:Q162255 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ; n1<P453:character_role> wd:Q551327 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Iron Man movie was not directed by Jon Favreau?\nEntities: [{'ID': 'Q180704', 'Label': 'Iron Man', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.6095}, {'ID': 'Q192724', 'Label': 'Iron Man', 'Description': '2008 film directed by Jon Favreau', 'Probability': 0.1488}, {'ID': 'Q295964', 'Label': 'Jon Favreau', 'Description': 'American actor, director, and screenwriter', 'Probability': 0.9059}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_311 WHERE { ?Q11424_311 wdt:P31 wd:Q11424 . ?Q11424_311 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q16642701 ] . FILTER ( NOT EXISTS { ?Q11424_311 p:<P57:director> [ ps:<P57:director> wd:Q295964 ] . } ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by Fernando Meirelles and starred Ralph Fiennes?\nEntities: [{'ID': 'Q343293', 'Label': 'Fernando Meirelles', 'Description': 'Brazilian film director', 'Probability': 1.0}, {'ID': 'Q28493', 'Label': 'Ralph Fiennes', 'Description': 'English actor (born 1962)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q28493 ] . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q343293 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was Chris Evans last in?\nEntities: [{'ID': 'Q2964710', 'Label': 'Chris Evans', 'Description': 'English television and radio presenter', 'Probability': 0.4677}, {'ID': 'Q178348', 'Label': 'Chris Evans', 'Description': 'American actor', 'Probability': 0.3548}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P577_12 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q178348 ] . ?Q11424_8 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_12 ] . } ORDER BY DESC(?P577_12) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Despicable Me movies are there?\nEntities: [{'ID': 'Q5264979', 'Label': 'Despicable Me', 'Description': 'media franchise', 'Probability': 0.8059}, {'ID': 'Q4447', 'Label': 'Despicable Me', 'Description': '2010 American computer-animated 3D comedy film', 'Probability': 0.1706}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?P527_9) AS ?number_of_47)WHERE { wd:Q98114628 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_9 ] .wd:Q98114628 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> wd:Q4447 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many movies has Jodie Foster directed?\nEntities: [{'ID': 'Q41351', 'Label': 'Jodie Foster', 'Description': 'American actress and filmmaker (born 1962)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_8) AS ?number_of_47) WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P57:director> [ ps:<P57:director> wd:Q41351 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the first president to be assassinated?\nEntities: [{'ID': 'Q11696', 'Label': 'President of the United States', 'Description': 'head of state and head of government of the United States of America', 'Probability': 0.5337}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n1<P580:start_time> ?P580_5 ; ps:<P39:position_held> wd:Q11696 ] . ?Q5_1 p:<P1196:manner_of_death> [ ps:<P1196:manner_of_death> wd:Q149086 ] . } ORDER BY ASC(?P580_5) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many World Series championships has Los Angeles Angels won?\nEntities: [{'ID': 'Q265538', 'Label': 'World Series', 'Description': 'championship of Major League Baseball', 'Probability': 0.5277}, {'ID': 'Q743309', 'Label': 'Los Angeles Angels', 'Description': 'baseball team and Major League Baseball franchise in Anaheim, California, United States', 'Probability': 0.8299}, {'ID': 'Q3259700', 'Label': 'Los Angeles Angels', 'Description': 'former Minor League Baseball team iteration of the El Paso Chihuahuas franchise', 'Probability': 0.1317}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q27020041_8) AS ?number_of_46)WHERE { ?Q27020041_8 wdt:P31 wd:Q27020041 .?Q27020041_8 p:<P1346:winner> [ ps:<P1346:winner> wd:Q743309 ] .?Q27020041_8 p:P3450 [ ps:P3450 wd:Q265538 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who played Max Schreck in Batman?\nEntities: [{'ID': 'Q58822', 'Label': 'Max Schreck', 'Description': 'German actor (1879-1936)', 'Probability': 1.0}, {'ID': 'Q2695156', 'Label': 'Batman', 'Description': 'comic book superhero', 'Probability': 0.6159}, {'ID': 'Q1247201', 'Label': 'Batman', 'Description': '1960s American television series', 'Probability': 0.1205}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q5_1 ?Q11424_38 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q11424_38 wdt:P31 wd:Q11424 . ?Q11424_38 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ] . ?Q11424_38 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q18914861 ] . wd:Q6007347 p:<P175:performer> [ ps:<P175:performer> ?Q5_1 ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie actor was born in Sydney, Australia and has played a role as a main character in the X-Men movies?\nEntities: [{'ID': 'Q3130', 'Label': 'Sydney', 'Description': 'capital city of New South Wales, Australia', 'Probability': 0.9056}, {'ID': 'Q408', 'Label': 'Australia', 'Description': 'country in Oceania', 'Probability': 0.8709}, {'ID': 'Q128452', 'Label': 'X-Men', 'Description': 'fictional superhero team in Marvel Comics', 'Probability': 0.625}, {'ID': 'Q17149274', 'Label': 'XMEN Disease', 'Description': 'human disease', 'Probability': 0.25}, {'ID': 'Q18047370', 'Label': 'MAGT1', 'Description': 'protein-coding gene in the species Homo sapiens', 'Probability': 0.125}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?P179_38 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> wd:Q3130 ] . ?P179_38 p:<P161:cast_member> [ ps:P161 ?Q5_1 ] . wd:Q106182 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> ?P179_38 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What year did Notorious Big die?\nEntities: [{'ID': 'Q179157', 'Label': 'The Notorious B.I.G.', 'Description': 'American rapper from New York (1972\u20131997)', 'Probability': 0.9615}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P570_8 ?expr_135 WHERE { wd:Q179157 p:<P570:date_of_death> [ ps:<P570:date_of_death> ?P570_8 ] . BIND (year(?P570_8) AS ?expr_135) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Peter Quill in Guardians of the Galaxy was born in which U.S. state?\nEntities: [{'ID': 'Q3496918', 'Label': 'Star-Lord', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.9429}, {'ID': 'Q5887360', 'Label': 'Guardians of the Galaxy', 'Description': '2014 film directed by James Gunn', 'Probability': 0.4873}, {'ID': 'Q2545790', 'Label': 'Guardians of the Galaxy', 'Description': '2008 superhero team by Marvel Comics', 'Probability': 0.2995}, {'ID': 'Q6653327', 'Label': 'Guardians of the Galaxy (1969 team)', 'Description': '1969 superhero team by Marvel Comics', 'Probability': 0.1607}, {'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.9022}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_46 ?P19_50 WHERE { ?Q5_46 wdt:P31 wd:Q5 . wd:Q5887360 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_46 ; n1:P4633 \"Peter Quill\" ] . ?Q5_46 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> ?P19_50 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Underworld movies are there?\nEntities: [{'ID': 'Q154365', 'Label': 'underworld', 'Description': 'supernatural realm, usually beneath the earth, in various mythologies', 'Probability': 0.3646}, {'ID': 'Q849429', 'Label': 'Underworld', 'Description': 'British electronic music duo', 'Probability': 0.1991}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_84) AS ?number_of_121) WHERE { ?Q11424_84 wdt:P31 wd:Q11424 . ?Q11424_84 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q82332 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the second Avengers movie in the series?\nEntities: [{'ID': 'Q322646', 'Label': 'Avengers', 'Description': 'comic book superhero team', 'Probability': 0.8506}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"2\" ; ps:<P179:part_of_the_series> wd:Q20021634 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Was The Notebook released in 2004?\nEntities: [{'ID': 'Q43013', 'Label': 'notebook', 'Description': 'book for writing, drawing, scrapbooking', 'Probability': 0.4382}, {'ID': 'Q3962', 'Label': 'laptop', 'Description': 'foldable portable personal computer for mobile use', 'Probability': 0.2135}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P577_8 WHERE { wd:Q223374 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the sixth president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"6\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        }