{
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Lorde's album Pure Heroine come out before 2015?\nEntities: [{'ID': 'Q13476175', 'Label': 'Lorde', 'Description': 'New Zealand singer-songwriter (born 1996)', 'Probability': 0.9915}, {'ID': 'Q15042463', 'Label': 'Pure Heroine', 'Description': '2013 studio album by Lorde', 'Probability': 0.9773}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 WHERE { wd:Q15042463 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . FILTER ( (?P577_8 < \"2015-01-01T00:00:00Z\"^^xsd:dateTime) ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the longest lake in the world?\nEntities: [{'ID': 'Q23397', 'Label': 'lake', 'Description': 'body of relatively still water, localized in a basin', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q23397_1 ?P2043_103 WHERE { ?Q23397_1 wdt:P31 n1:Q23397 . ?Q23397_1 p:<P2043:length> [ ps:<P2043:length> ?P2043_103 ] . } ORDER BY DESC(?P2043_103)\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many movies are there in the Twilight movie series?\nEntities: [{'ID': 'Q160071', 'Label': 'Twilight', 'Description': '2008 film directed by Catherine Hardwicke', 'Probability': 0.2113}, {'ID': 'Q164160', 'Label': 'twilight', 'Description': \"illumination of the Earth's lower atmosphere when the Sun itself is not directly visible because it is below the horizon\", 'Probability': 0.1569}, {'ID': 'Q44523', 'Label': 'Twilight', 'Description': 'series of vampire romance novels by Stephenie Meyer', 'Probability': 0.1133}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_84) AS ?number_of_121) WHERE { ?Q11424_84 wdt:P31 wd:Q11424 . ?Q11424_84 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q652599 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: In what year did the first X-Men movie release?\nEntities: [{'ID': 'Q128452', 'Label': 'X-Men', 'Description': 'fictional superhero team in Marvel Comics', 'Probability': 0.625}, {'ID': 'Q17149274', 'Label': 'XMEN Disease', 'Description': 'human disease', 'Probability': 0.25}, {'ID': 'Q18047370', 'Label': 'MAGT1', 'Description': 'protein-coding gene in the species Homo sapiens', 'Probability': 0.125}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT (MIN(?expr_198) AS ?minimum_215) WHERE { wd:Q2006869 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_8 ] . ?P527_8 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_112 ] . BIND (year(?P577_112) AS ?expr_198) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What James Bond movie was released in 1997?\nEntities: [{'ID': 'Q844', 'Label': 'James Bond', 'Description': 'series of books about a British spy', 'Probability': 0.8176}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P577_45WHERE { ?Q11424_8 wdt:P31 wd:Q11424 .?Q11424_8 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_45 ] .?Q11424_8 p:<P144:based_on> [ ps:<P144:based_on> wd:Q844 ] .FILTER ( (year(?P577_45) = \"1997\"^^xsd:integer) ) }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Justin Trudeau become prime minister before 2016?\nEntities: [{'ID': 'Q3099714', 'Label': 'Justin Trudeau', 'Description': 'Prime Minister of Canada since 2015', 'Probability': 0.9991}]\n\n###\n\n",
            "completion": "ASK WHERE { wd:Q3099714 p:<P39:position_held> [ n1<P580:start_time> ?P580_4 ; ps:<P39:position_held> wd:Q839078 ] . FILTER (?P580_4 < \"2016-01-01\"^^xsd:dateTime)}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many countries in North America?\nEntities: [{'ID': 'Q49', 'Label': 'North America', 'Description': \"continent on the Earth's northwestern quadrant, spanning from the Arctic Archipelago to the Panama Isthmus\", 'Probability': 0.9897}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q6256_1 WHERE { ?Q6256_1 wdt:P31 wd:Q6256 . ?Q6256_1 p:<P30:continent> [ ps:<P30:continent> wd:Q49 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 20th president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"20\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actor starred in Vanilla Sky and was married to Katie Holmes?\nEntities: [{'ID': 'Q110278', 'Label': 'Vanilla Sky', 'Description': '2001 film by Cameron Crowe', 'Probability': 0.8806}, {'ID': 'Q174346', 'Label': 'Katie Holmes', 'Description': 'American actress, director, and producer', 'Probability': 0.9924}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 n1:Q5 . n1:Q110278 wdt:P161 ?Q5_1 . n1:Q174346 wdt:P26 ?Q5_1 . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who was the 16th president of the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n2<P1545:series_ordinal> \"16\" ; ps:<P39:position_held> wd:Q11696 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the smallest country in North America by population?\nEntities: [{'ID': 'Q49', 'Label': 'North America', 'Description': \"continent on the Earth's northwestern quadrant, spanning from the Arctic Archipelago to the Panama Isthmus\", 'Probability': 0.9897}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q6256_1 ?P1082_6 WHERE { ?Q6256_1 wdt:P31 wd:Q6256 . ?Q6256_1 p:<P30:continent> [ ps:<P30:continent> wd:Q49 ] . ?Q6256_1 p:<P1082:population> [ ps:<P1082:population> ?P1082_6 ] . } ORDER BY ASC(?P1082_6) LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actor played Spider-Man and was born in England?\nEntities: [{'ID': 'Q79037', 'Label': 'Spider-Man', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.3261}, {'ID': 'Q21', 'Label': 'England', 'Description': 'country in north-west Europe, part of the United Kingdom', 'Probability': 0.7456}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?Q11424_38 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q11424_38 wdt:P31 wd:Q11424 . ?Q11424_38 p:<P161:cast_member> [ ps:<P161:cast_member> ?Q5_1 ; n1:P4633 \"Peter Parker / Spider-Man\" ] . ?Q5_1 p:<P27:country_of_citizenship> [ ps:<P27:country_of_citizenship> wd:Q145 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the third part of the Fast & Furious?\nEntities: [{'ID': 'Q1576873', 'Label': 'Fast & Furious', 'Description': 'American action film franchise', 'Probability': 0.5337}, {'ID': 'Q380996', 'Label': 'Fast & Furious', 'Description': '2009 film directed by Justin Lin', 'Probability': 0.3988}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"3\" ; ps:<P179:part_of_the_series> wd:Q1576873 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What country was Drake's birthplace?\nEntities: [{'ID': 'Q33240', 'Label': 'Drake', 'Description': 'Canadian rapper, singer, songwriter and actor', 'Probability': 0.7556}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?thing_9 ?P27_47 WHERE { ?thing_9 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> wd:Q2000126 ] . ?thing_9 p:<P27:country_of_citizenship> [ ps:<P27:country_of_citizenship> ?P27_47 ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many members are in Spice Girls?\nEntities: [{'ID': 'Q55641', 'Label': 'Spice Girls', 'Description': 'British girl group', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_39 WHERE { ?Q5_39 wdt:P31 wd:Q5 . wd:Q55641 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?Q5_39 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When did Denzel Washington win his first Academy Award for Best Supporting Actor?\nEntities: [{'ID': 'Q42101', 'Label': 'Denzel Washington', 'Description': 'American actor, director and producer (born 1954)', 'Probability': 1.0}, {'ID': 'Q106291', 'Label': 'Academy Award for Best Supporting Actor', 'Description': 'one of the Academy Awards of Merit', 'Probability': 0.9943}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P585_2 WHERE { wd:Q42101 p:<P166:award_received> [ ps:<P166:award_received> wd:Q106291 ; n1<P585:point_in_time> ?P585_2 ] . }\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the fourth book in the Wheel of Time series?\nEntities: [{'ID': 'Q4470', 'Label': 'The Wheel of Time', 'Description': 'series of fantasy novels by Robert Jordan', 'Probability': 0.4921}, {'ID': 'Q7992037', 'Label': 'Wheel of time', 'Description': 'religious and philosophical concept of cyclical, repeating epochs or ages', 'Probability': 0.2063}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ n2<P1545:series_ordinal> \"4\" ; ps:<P179:part_of_the_series> wd:Q4470 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Spider-Man movie had the smallest budget?\nEntities: [{'ID': 'Q79037', 'Label': 'Spider-Man', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.3261}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q11424_24 ?P2130_29 WHERE { ?Q11424_24 wdt:P31 wd:Q11424 . ?Q11424_24 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q18636789 ] . ?Q11424_24 p:<P2130:cost> [ ps:<P2130:cost> ?P2130_29 ] . } ORDER BY ASC(?P2130_29) LIMIT  }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What year was Madonna born?\nEntities: [{'ID': 'Q1744', 'Label': 'Madonna', 'Description': 'American singer, songwriter and actress (born 1958)', 'Probability': 0.8998}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (year(xsd:dateTime(?P569_8)) as ?birthYear) WHERE { wd:Q1744 p:<P569:date_of_birth> [ ps:<P569:date_of_birth> ?P569_8 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Citizen Kane come out before 1950?\nEntities: [{'ID': 'Q24815', 'Label': 'Citizen Kane', 'Description': '1941 American drama film directed by Orson Welles', 'Probability': 0.9931}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P577_8 ?expr_94 WHERE { wd:Q24815 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_94) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the third Pirates of the Caribbean movie to be released?\nEntities: [{'ID': 'Q384426', 'Label': 'Pirates of the Caribbean', 'Description': 'Disney amusement franchise', 'Probability': 0.3834}, {'ID': 'Q194318', 'Label': 'Pirates of the Caribbean', 'Description': 'Series of fantasy adventure films', 'Probability': 0.3791}, {'ID': 'Q1713564', 'Label': 'Pirates of the Caribbean', 'Description': 'dark ride type at Disney theme parks', 'Probability': 0.1721}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_9 WHERE { ?Q11424_9 wdt:P31 wd:Q11424 . ?Q11424_9 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"3\" ; ps:<P179:part_of_the_series> wd:Q194318 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Iron Man movies did Terrance Howard not appear in?\nEntities: [{'ID': 'Q180704', 'Label': 'Iron Man', 'Description': 'fictional character in Marvel Comics', 'Probability': 0.6095}, {'ID': 'Q192724', 'Label': 'Iron Man', 'Description': '2008 film directed by Jon Favreau', 'Probability': 0.1488}, {'ID': 'Q296500', 'Label': 'Terrence Howard', 'Description': 'American actor', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P144:based_on> [ ps:<P144:based_on> wd:Q180704 ] . FILTER ( NOT EXISTS { ?Q11424_8 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q296500 ] . } ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Hunger Games movie is the longest?\nEntities: [{'ID': 'Q11679', 'Label': 'The Hunger Games', 'Description': 'three books by Suzanne Collins (2008\u20132010)', 'Probability': 0.6716}, {'ID': 'Q212965', 'Label': 'The Hunger Games', 'Description': '2012 film by Gary Ross', 'Probability': 0.2239}, {'ID': 'Q11885031', 'Label': 'The Hunger Games', 'Description': 'dystopian film series', 'Probability': 0.1045}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P2142_12 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q11885031 ] . ?Q11424_8 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_12 ] . } ORDER BY DESC(?P2142_12) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Indiana Jones movie made the most money?\nEntities: [{'ID': 'Q2562640', 'Label': 'Indiana Jones', 'Description': \"entertainment franchise originating in the 80's\", 'Probability': 0.5413}, {'ID': 'Q148659', 'Label': 'Indiana Jones', 'Description': 'fictional archaeologist', 'Probability': 0.4196}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P2142_12 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q98018448 ] . ?Q11424_8 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_12 ] . } ORDER BY DESC(?P2142_12) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many games are in the Half-Life series?\nEntities: [{'ID': 'Q1931125', 'Label': 'Halflife', 'Description': 'EP by Lacuna Coil, released in 2000', 'Probability': 0.375}, {'ID': 'Q47270', 'Label': 'half-life', 'Description': 'mean duration after which a decaying quantity has reached half of its initial value', 'Probability': 0.2917}, {'ID': 'Q5641870', 'Label': 'Halflife', 'Description': 'book by Mark Michalowski', 'Probability': 0.25}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(?P527_9) as ?p) WHERE { wd:Q752241 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?P527_9 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was Tom Clancy's first book?\nEntities: [{'ID': 'Q105167', 'Label': 'Tom Clancy', 'Description': 'American author', 'Probability': 0.9502}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q47461344_1 ?P577_38 WHERE { ?Q47461344_1 wdt:P31 wd:Q47461344 . ?Q47461344_1 p:<P50:author> [ ps:<P50:author> wd:Q105167 ] . ?Q47461344_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_38 ] . } ORDER BY ASC(?P577_38) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Angela Merkel become prime minister before 2000?\nEntities: [{'ID': 'Q567', 'Label': 'Angela Merkel', 'Description': 'chancellor of Germany from 2005 to 2021', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "ASK WHERE { wd:Q567 p:<P39:position_held> [ n1<P580:start_time> ?P580_4 ; ps:<P39:position_held> wd:Q4970706 ] . FILTER (?P580_4 > \"2000-01-01\"^^xsd:dateTime)}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie starred both Chris Farley and Matthew Perry?\nEntities: [{'ID': 'Q311752', 'Label': 'Chris Farley', 'Description': 'American actor and comedian (1964\u20131997)', 'Probability': 1.0}, {'ID': 'Q171758', 'Label': 'Matthew Perry', 'Description': 'Canadian-American actor', 'Probability': 0.6806}, {'ID': 'Q61855', 'Label': 'Matthew C. Perry', 'Description': 'American naval officer (1794-1858)', 'Probability': 0.3021}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q311752 ] . ?Q11424_1 p:<P161:cast_member> [ ps:<P161:cast_member> wd:Q171758 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What character had the nickname butcher of Blaviken?\nEntities: [{'ID': 'Q19007130', 'Label': 'Blaviken', 'Description': 'fictional city in the Witcher series', 'Probability': 0.9876}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q3658341_8 WHERE { ?Q3658341_8 wdt:P31 wd:Q3658341 . ?Q3658341_8 p:<P1449:nickname> [ ps:<P1449:nickname> \"Le boucher de Blaviken\"@fr ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which movie was directed by George Lucas and came out in 1977?\nEntities: [{'ID': 'Q38222', 'Label': 'George Lucas', 'Description': 'American filmmaker', 'Probability': 0.9817}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P577_38 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P57:director> [ ps:<P57:director> wd:Q38222 ] . ?Q11424_1 p:<P57:director>7 [ ps:<P57:director>7 ?P577_38 ] . FILTER ( (year(?P577_38) = \"1977\"^^xsd:integer) ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the second book in the Wheel of Time series?\nEntities: [{'ID': 'Q4470', 'Label': 'The Wheel of Time', 'Description': 'series of fantasy novels by Robert Jordan', 'Probability': 0.4921}, {'ID': 'Q7992037', 'Label': 'Wheel of time', 'Description': 'religious and philosophical concept of cyclical, repeating epochs or ages', 'Probability': 0.2063}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ n2<P1545:series_ordinal> \"2\" ; ps:<P179:part_of_the_series> wd:Q4470 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which TWICE members were not born in South Korea?\nEntities: [{'ID': 'Q20645861', 'Label': 'Twice', 'Description': 'South Korean girl group', 'Probability': 0.8}, {'ID': 'Q884', 'Label': 'South Korea', 'Description': 'country in East Asia', 'Probability': 0.9206}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P463_8 ?P19_111 WHERE { ?P463_8 p:<P463:member_of> [ ps:<P463:member_of> wd:Q20645861 ] . ?P463_8 p:<P19:place_of_birth> [ ps:<P19:place_of_birth> ?P19_111 ] . FILTER ( NOT EXISTS { ?P19_111 p:<P17:country> [ ps:<P17:country> wd:Q884 ] . } ) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What was the fourth Twilight movie chronologically?\nEntities: [{'ID': 'Q160071', 'Label': 'Twilight', 'Description': '2008 film directed by Catherine Hardwicke', 'Probability': 0.2113}, {'ID': 'Q164160', 'Label': 'twilight', 'Description': \"illumination of the Earth's lower atmosphere when the Sun itself is not directly visible because it is below the horizon\", 'Probability': 0.1569}, {'ID': 'Q44523', 'Label': 'Twilight', 'Description': 'series of vampire romance novels by Stephenie Meyer', 'Probability': 0.1133}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P1545_6 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> ?P1545_6 ; ps:<P179:part_of_the_series> wd:Q652599 ] . } ORDER BY ASC(xsd:integer(?P1545_6)) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: In which year did the first Lord of the Rings movie come out?\nEntities: [{'ID': 'Q15228', 'Label': 'The Lord of the Rings', 'Description': '1954\u20131955 fantasy novel by J. R. R. Tolkien', 'Probability': 0.5616}, {'ID': 'Q190214', 'Label': 'The Lord of the Rings trilogy', 'Description': '2001-2003 three films directed by Peter Jackson', 'Probability': 0.2414}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?Q11424_24 ?P577_28 ?expr_155 WHERE { ?Q11424_24 wdt:P31 wd:Q11424 . ?Q11424_24 p:<P179:part_of_the_series> [ n1<P1545:series_ordinal> \"1\" ; ps:<P179:part_of_the_series> wd:Q190214 ] . ?Q11424_24 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_28 ] . BIND (year(?P577_28) AS ?expr_155) } ORDER BY ASC(?expr_155) LIMIT 1 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Foundation series book by Issac Asimov have been released in 1990's?\nEntities: [{'ID': 'Q34981', 'Label': 'Isaac Asimov', 'Description': 'American writer and biochemist (1920\u20131992)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_1 ?P577_5 ?expr_131 WHERE { ?Q7725634_1 wdt:P31 wd:Q7725634 . ?Q7725634_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q1564644 ] . ?Q7725634_1 p:<P50:author> [ ps:<P50:author> wd:Q34981 ] . ?Q7725634_1 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_5 ] . BIND (year(?P577_5) AS ?expr_131) FILTER ( xsd:double(str(?expr_131)) >= 1990 ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Who wrote the Ender's Game series?\nEntities: [{'ID': 'Q816016', 'Label': \"Ender's Game\", 'Description': '1985 novel by Orson Scott Card', 'Probability': 0.5988}, {'ID': 'Q1758112', 'Label': \"Ender's Game\", 'Description': '2013 film directed by Gavin Hood', 'Probability': 0.2716}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P50_8WHERE { wd:Q2642928 p:<P50:author> [ ps:<P50:author> ?P50_8 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many members were in the band Nirvana?\nEntities: [{'ID': 'Q11649', 'Label': 'Nirvana', 'Description': 'American rock band', 'Probability': 0.7594}, {'ID': 'Q42927', 'Label': 'nirvana', 'Description': 'soteriological goal within the Indian religions', 'Probability': 0.1431}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_39 WHERE { ?Q5_39 wdt:P31 wd:Q5 . wd:Q11649 p:<P527:has_part(s)> [ ps:<P527:has_part(s)> ?Q5_39 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How many Die Hard movies are there?\nEntities: [{'ID': 'Q105598', 'Label': 'Die Hard', 'Description': '1988 American action film by John McTiernan', 'Probability': 0.8029}, {'ID': 'Q2716420', 'Label': 'Die Hard', 'Description': 'series of action movies beginning with Die Hard in 1988', 'Probability': 0.1014}]\n\n###\n\n",
            "completion": "SELECT DISTINCT (COUNT(DISTINCT ?Q11424_197) AS ?number_of_234) WHERE { ?Q11424_197 wdt:P31 wd:Q11424 . ?Q11424_197 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q2716420 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: When did Brad Pitt win his first Oscar for acting?\nEntities: [{'ID': 'Q35332', 'Label': 'Brad Pitt', 'Description': 'American actor and filmmaker', 'Probability': 0.9927}, {'ID': 'Q19020', 'Label': 'Academy Awards', 'Description': 'annual awards for cinematic achievements', 'Probability': 0.6452}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q19020_8 ?P585_48 WHERE { ?Q19020_8 wdt:P31 wd:Q19020 . wd:Q35332 p:<P166:award_received> [ ps:<P166:award_received> ?Q19020_8 ; n1<P585:point_in_time> ?P585_48 ] . } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Harry Potter movie made the least money?\nEntities: [{'ID': 'Q8337', 'Label': 'Harry Potter', 'Description': 'fantasy literature series by J.K. Rowling', 'Probability': 0.6864}, {'ID': 'Q216930', 'Label': 'Harry Potter film series', 'Description': 'fantasy film series adaptation of the Harry Potter novels', 'Probability': 0.1666}, {'ID': 'Q3244512', 'Label': 'Harry Potter', 'Description': 'fictional character of the Harry Potter book series', 'Probability': 0.115}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_1 ?P2142_7 WHERE { ?Q11424_1 wdt:P31 wd:Q11424 . ?Q11424_1 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_7 ] . ?Q11424_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q216930 ] . } ORDER BY ASC(?P2142_7) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: How did Ernest Hemingway die?\nEntities: [{'ID': 'Q23434', 'Label': 'Ernest Hemingway', 'Description': 'American author and journalist (1899\u20131961)', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?P1196_8WHERE { wd:Q23434 p:<P1196:manner_of_death> [ ps:<P1196:manner_of_death> ?P1196_8 ] . }LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Did Kill Bill: Vol. 1 come out after 2004?\nEntities: [{'ID': 'Q165325', 'Label': 'Kill Bill Volume 1', 'Description': '2003 American film by Quentin Tarantino', 'Probability': 1.0}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P577_8 ?expr_134 WHERE { wd:Q165325 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_8 ] . BIND (year(?P577_8) AS ?expr_134) } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What game in the Grand Theft Auto series sold the most copies?\nEntities: [{'ID': 'Q132730', 'Label': 'Grand Theft Auto', 'Description': 'action-adventure video game series', 'Probability': 0.6884}, {'ID': 'Q94501', 'Label': 'Grand Theft Auto', 'Description': '1997 action-adventure open world video game', 'Probability': 0.1302}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7889_1 ?P2664_6 WHERE { ?Q7889_1 wdt:P31 wd:Q7889 . ?Q7889_1 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q132730 ] . ?Q7889_1 p:<P2664:units_sold> [ ps:<P2664:units_sold> ?P2664_6 ] . } ORDER BY DESC(?P2664_6) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which American presidency was the shortest?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.7905}, {'ID': 'Q846570', 'Label': 'Americans', 'Description': 'citizens or residents of the United States of America', 'Probability': 0.1607}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q5_1 ?P582_95 ?P580_5 ?expr_91 ?expr_224 WHERE { ?Q5_1 wdt:P31 wd:Q5 . ?Q5_1 p:<P39:position_held> [ n1<P582:end_time> ?P582_95 ; n1<P580:start_time> ?P580_5 ; ps:<P39:position_held> wd:Q11696 ] . BIND (year(?P580_5) AS ?expr_91) BIND (abs((?expr_91 - year(?P582_95))) AS ?expr_224) } ORDER BY ASC(?expr_224) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which actor played Luke Skywalker and voiced the Joker?\nEntities: [{'ID': 'Q51746', 'Label': 'Luke Skywalker', 'Description': 'fictional character from Star Wars', 'Probability': 0.9942}, {'ID': 'Q217533', 'Label': 'Joker', 'Description': 'fictional character throughout the DC Universe', 'Probability': 0.5757}, {'ID': 'Q42759035', 'Label': 'Joker', 'Description': '2019 film directed by Todd Phillips', 'Probability': 0.1365}]\n\n###\n\n",
            "completion": "SELECT * WHERE {{ SELECT DISTINCT ?P175_8 WHERE { wd:Q217533 p:<P175:performer> [ ps:<P175:performer> ?P175_8 ] . wd:Q51746 p:<P175:performer> [ ps:<P175:performer> ?P175_8 ] . } LIMIT 200 }}\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which Lord of the Rings film made the most money?\nEntities: [{'ID': 'Q15228', 'Label': 'The Lord of the Rings', 'Description': '1954\u20131955 fantasy novel by J. R. R. Tolkien', 'Probability': 0.5616}, {'ID': 'Q190214', 'Label': 'The Lord of the Rings trilogy', 'Description': '2001-2003 three films directed by Peter Jackson', 'Probability': 0.2414}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q11424_8 ?P2142_12 WHERE { ?Q11424_8 wdt:P31 wd:Q11424 . ?Q11424_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q190214 ] . ?Q11424_8 p:<P2142:box_office> [ ps:<P2142:box_office> ?P2142_12 ] . } ORDER BY DESC(?P2142_12) LIMIT 1\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: Which book in the Game of Thrones series was released in 2000?\nEntities: [{'ID': 'Q23572', 'Label': 'Game of Thrones', 'Description': 'American fantasy drama television series', 'Probability': 0.9644}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q7725634_8 ?P577_45 WHERE { ?Q7725634_8 wdt:P31 wd:Q7725634 . wd:Q45875 p:<P4969:derivative_work> [ ps:<P4969:derivative_work> wd:Q23572 ] . ?Q7725634_8 p:<P179:part_of_the_series> [ ps:<P179:part_of_the_series> wd:Q45875 ] . ?Q7725634_8 p:<P577:publication_date> [ ps:<P577:publication_date> ?P577_45 ] . FILTER ( (year(?P577_45) = \"2000\"^^xsd:integer) ) } LIMIT 200\n"
        },
        {
            "prompt": "Given the Question and the entities generate a SPARQL query.\nQuestion: What is the second biggest state in the United States?\nEntities: [{'ID': 'Q30', 'Label': 'United States of America', 'Description': 'country in North America', 'Probability': 0.948}]\n\n###\n\n",
            "completion": "SELECT DISTINCT ?Q35657_1 WHERE { ?Q35657_1 wdt:P31 wd:Q35657 . ?Q35657_1 p:<P2046:area> [ ps:<P2046:area> ?P2046_104 ] . } ORDER BY DESC(?P2046_104) LIMIT 1 OFFSET 1\n"
        }